Repository: Rdatatable/data.table
Catalog: hindi_files/fifelse-*.po
Languages: hi_in

source: Argument 'test' must be logical.
hi_in: आर्गुमेंट (argument) 'test' लॉजिकल (logical) होना चाहिए।

source: S4 class objects (except nanotime) are not supported.
hi_in: S4 क्लास (class) के ऑब्जेक्ट्स (objects) (सिवाय nanotime) का समर्थन नहीं किया जाता है।

source: Length of 'yes' is %<PRId64> but must be 1 or length of 'test' (%<PRId64>).
hi_in: 'yes' की लेंथ (length) %<PRId64> है लेकिन इसे 1 या 'test' (%<PRId64>) की लेंथ (length) का होना चाहिए।

source: Length of 'no' is %<PRId64> but must be 1 or length of 'test' (%<PRId64>).
hi_in: 'no' की लेंथ (length) %<PRId64> है लेकिन इसे 1 या 'test' (%<PRId64>) की लेंथ (length) का होना चाहिए।

source: Length of 'na' is %<PRId64> but must be 1 or length of 'test' (%<PRId64>).
hi_in: 'na' की लेंथ (length) %<PRId64> है लेकिन इसे 1 या 'test' (%<PRId64>) की लेंथ (length) का होना चाहिए।

source: 'no' is of type %s but '%s' is %s. Please make all arguments have the same type.
hi_in: 'no' प्रकार %s का है लेकिन '%s' %s है।कृपया सभी आर्गुमेंट्स (arguments) को एक ही प्रकार का बनाएं।

source: 'na' is of type %s but '%s' is %s. Please make all arguments have the same type.
hi_in: 'no' प्रकार %s का है लेकिन '%s' %s है।कृपया सभी आर्गुमेंट्स (arguments) को एक ही प्रकार का बनाएं।

source: 'yes' has different class than 'no'. Please make sure that both arguments have the same class.
hi_in: 'yes' की 'no' से अलग क्लास (class) है।कृपया सुनिश्चित करें कि दोनों आर्गुमेंट्स (arguments) की क्लास (class) समान हो।

source: 'yes' has different class than 'na'. Please make sure that both arguments have the same class.
hi_in: 'yes' की 'na' से अलग क्लास (class) है।कृपया सुनिश्चित करें कि दोनों आर्गुमेंट्स (arguments) की क्लास (class) समान हो।

source: 'no' has different class than 'na'. Please make sure that both arguments have the same class.
hi_in: 'no' की 'na' से अलग क्लास (class) है।कृपया सुनिश्चित करें कि दोनों आर्गुमेंट्स (arguments) की क्लास (class) समान हो।

source: 'yes' and 'no' are both type factor but their levels are different.
hi_in: 'yes' और 'no' दोनों का प्रकार फ़ैक्टर (factor) हैं लेकिन उनके स्तर भिन्न हैं।

source: 'yes' and 'na' are both type factor but their levels are different.
hi_in: 'yes' और 'na' दोनों का प्रकार फ़ैक्टर (factor) हैं लेकिन उनके स्तर भिन्न हैं।

source: 'no' and 'na' are both type factor but their levels are different.
hi_in: 'no' और 'na' दोनों का प्रकार फ़ैक्टर (factor) हैं लेकिन उनके स्तर भिन्न हैं।

source: Type '%s' is not supported
hi_in: प्रकार '%s' का समर्थन नहीं किया जाता है।

source: Received %d inputs; please supply an even number of arguments in ..., consisting of logical condition, resulting value pairs (in that order). Note that the default argument must be named explicitly, e.g., default=0
hi_in: %d इनपुट (input) प्राप्त हुए; कृपया ... में आर्गुमेंट्स (arguments) की एक सम संख्या प्रदान करेंजिसमें तार्किक स्थिति, परिणामस्वरूप मान के जोड़े (इस क्रम में) शामिल हों।ध्यान दें कि डिफ़ॉल्ट (default) आर्गुमेंट (argument) को स्पष्ट रूप से नामित किया जाना चाहिए, जैसे, default=0

source: S4 class objects (except nanotime) are not supported. Please see https://github.com/Rdatatable/data.table/issues/4131.
hi_in: S4 क्लास (class) के ऑब्जेक्ट (object) (सिवाय nanotime) का समर्थन नहीं किया जाता है।कृपया https://github.com/Rdatatable/data.table/issues/4131 देखें।

source: Argument #%d must be logical but was of type %s.
hi_in: आर्गुमेंट (argument) #%d लॉजिकल (logical) होना चाहिए लेकिन यह %s प्रकार का है।

source: Argument #%d has length %lld which differs from that of argument #1 (%lld). Please make sure all logical conditions have the same length.
hi_in: आर्गुमेंट (argument) #%d की लेंथ (length) %lld है जो आर्गुमेंट (argument) #1 (%lld) से भिन्न है।कृपया सुनिश्चित करें कि सभी तार्किक स्थितियों की लेंथ (length) समान हो।

source: Resulting value is of type %s but 'default' is of type %s. Please make sure that both arguments have the same type.
hi_in: परिणामी मान प्रकार %s का है लेकिन 'डिफ़ॉल्ट’ ('default') प्रकार %s का है।कृपया सुनिश्चित करें कि दोनों आर्गुमेंट्स (arguments) का प्रकार समान हो।

source: Argument #%d is of type %s, however argument #2 is of type %s. Please make sure all output values have the same type.
hi_in: आर्गुमेंट (argument) #%d प्रकार %s का है, हालाँकि आर्गुमेंट (argument) #2 प्रकार %s का है।कृपया सुनिश्चित करें कि सभी आउटपुट (output) मान का प्रकार समान हो।

source: Resulting value has different class than 'default'. Please make sure that both arguments have the same class.
hi_in: परिणामी मान की 'डिफ़ॉल्ट' (default) से अलग क्लास (class) है।कृपया सुनिश्चित करें कि दोनों आर्गुमेंट्स (arguments) की क्लास (class) समान हो।

source: Argument #%d has different class than argument #2, Please make sure all output values have the same class.
hi_in: आर्गुमेंट (argument) #%d की आर्गुमेंट (argument) #2 से अलग क्लास (class) है,कृपया सुनिश्चित करें कि सभी आउटपुट (output) मान की क्लास (class) समान हो।

source: Resulting value and 'default' are both type factor but their levels are different.
hi_in: परिणामी मान और 'डिफ़ॉल्ट' (default) दोनों का प्रकार फ़ैक्टर (factor) हैं लेकिन उनके स्तर (levels) भिन्न हैं।

source: Argument #2 and argument #%d are both factor but their levels are different.
hi_in: आर्गुमेंट (argument) #2 और आर्गुमेंट (argument) #%d दोनों फ़ैक्टर (factor) हैं लेकिन उनके स्तर (levels) भिन्न हैं।

source: Length of 'default' must be 1 or %lld.
hi_in: 'डिफ़ॉल्ट' ('default') की लेंथ (length) 1 या %lld होनी चाहिए।

source: Length of output value #%d (%lld) must either be 1 or match the length of the logical condition (%lld).
hi_in: आउटपुट (output) मान #%d (%lld) की लेंथ (length) 1 होनी चाहिए यातार्किक स्थिति की लेंथ (length) (%lld) के साथ मेल खानी चाहिए।

source: Type '%s' is not supported.
hi_in: प्रकार '%s' का समर्थन नहीं किया जाता है।
