Repository: Rdatatable/data.table
Catalog: hindi_files/freadR-*.po
Languages: hi_in

source: freadR.c has been passed a filename: %s
hi_in: freadR.c को एक फाइल (file) नाम पास (pass) किया गया है: %s

source: freadR.c has been passed the data as text input (not a filename)
hi_in: freadR.c को डेटा (data) पाठ इनपुट (input) के रूप में पास (pass) किया गया है (फाइल (file) नाम नहीं)

source: quote= must be a single character, blank "", or FALSE
hi_in: quote= एक सिंगल (single) कैरेक्टर (character), खाली "", या False होना चाहिए

source: 'integer64' must be a single character string
hi_in: 'integer64' एक सिंगल (single) कैरेक्टर (character) स्ट्रिंग (string) होनी चाहिए

source: Invalid value integer64='%s'. Must be 'integer64', 'character', 'double' or 'numeric'
hi_in: अमान्य मान integer64='%s'। यह 'integer64', 'कैरेक्टर (character)', 'डबल (double)' या 'न्यूमेरिक (numeric)' होना चाहिए

source: Use either select= or drop= but not both.
hi_in: या तो select= या drop= का उपयोग करें लेकिन दोनों का नहीं।

source: select= is type list for specifying types in select=, but colClasses= has been provided as well. Please remove colClasses=.
hi_in: select= में types निर्दिष्ट करने के लिए select= का type लिस्ट (list) है, लेकिन colClasses= भी प्रदान किया गया है। कृपया colClasses= हटा दें।" हटा दें।

source: select= is type list but has no names; expecting list(type1=cols1, type2=cols2, ...)
hi_in: select= type लिस्ट (list) है लेकिन इसका कोई नाम नहीं है; लिस्ट (list)(type1=cols1, type2=cols2, ...) की अपेक्षा है

source: select= is a named vector specifying the columns to select and their types, but colClasses= has been provided as well. Please remove colClasses=.
hi_in: select= एक नामित वेक्टर (vector) है जो चुनने के लिए कॉलम (column) और उनके types निर्दिष्ट करता है, लेकिन colClasses= भी प्रदान किया गया है। कृपया colClasses= हटा दें।

source: colClasses is type list but has no names
hi_in: colClasses type लिस्ट (list) है लेकिन इसके कोई नाम नहीं हैं

source: encoding='%s' invalid. Must be 'unknown', 'Latin-1' or 'UTF-8'
hi_in: encoding='%s' अमान्य है। 'unknown', 'Latin-1' या 'UTF-8' होना चाहिए

source: Column name '%s' (%s) not found
hi_in: कॉलम (column) नाम '%s' (%s) नहीं मिला

source: %s is NA
hi_in: %s NA है

source: %s is %d which is out of range [1,ncol=%d]
hi_in: %s, %d है जो range [1,ncol=%d] से बाहर है

source: Column name '%s' not found in column name header (case sensitive), skipping.
hi_in: कॉलम (column) नाम '%s' कॉलम (column) नाम हेडर (header) (case sensitive) में नहीं मिला, छोड़ा जा रहा है।

source: Column number %d (select[%d]) is negative but should be in the range [1,ncol=%d]. Consider drop= for column exclusion.
hi_in: कॉलम (column) संख्या %d (select[%d]) नकारात्मक है लेकिन range [1, ncol=%d] में होनी चाहिए। कॉलम (column) अपवर्जन के लिए drop= पर विचार करें।

source: select = 0 (select[%d]) has no meaning. All values of select should be in the range [1,ncol=%d].
hi_in: select = 0 (select[%d]) का कोई अर्थ नहीं है। select के सभी मानों range [1,ncol=%d] में होने चाहिए।

source: Column number %d (select[%d]) is too large for this table, which only has %d columns.
hi_in: कॉलम (column) संख्या %d (select[%d]) इस टेबल के लिए बहुत बड़ी है, जिसमें केवल %d कॉलम (column) हैं।

source: Column number %d ('%s') has been selected twice by select=
hi_in: कॉलम (column) संख्या %d ('%s') को select= द्वारा दो बार चुना गया है

source: colClasses= is an unnamed vector of types, length %d, but there are %d columns in the input. To specify types for a subset of columns, you can use a named vector, list format, or specify types using select= instead of colClasses=. Please see examples in ?fread.
hi_in: colClasses= types का एक अनाम वेक्टर (vector) है, जिसकी लेंथ (length) %d है, लेकिन इनपुट (input) में %d कॉलम (column) हैं। कॉलम (column) के सबसेट (subset) के लिए types निर्दिष्ट करने के लिए, आप एक नामित वेक्टर (vector), लिस्ट (list) फ़ॉर्मेट का उपयोग कर सकते हैं, या colClasses= के बजाय select= का उपयोग करके types निर्दिष्ट कर सकते हैं। कृपया ?fread में उदाहरण देखें।

source: colClasses is type '%s' but should be list or character
hi_in: colClasses type '%s' है लेकिन लिस्ट (list) या कैरेक्टर (character) होना चाहिए

source: Column name '%s' (colClasses[[%d]][%d]) not found
hi_in: कॉलम (column) नाम '%s' (colClasses[[%d]][%d]) नहीं मिला

source: colClasses[[%d]][%d] is NA
hi_in: colClasses[[%d]][%d] NA है

source: Column number %d (colClasses[[%d]][%d]) is out of range [1,ncol=%d]
hi_in: कॉलम (column) संख्या %d (colClasses[[%d]][%d]) range [1,ncol=%d] से बाहर है

source: Column %d ('%s') appears more than once in colClasses. The second time is colClasses[[%d]][%d].
hi_in: कॉलम (column) %d ('%s') colClasses में एक से अधिक बार दिखाई देता है। दूसरी बार colClasses[[%d]][%d] है।

source: Field size is 1 but the field is of type %d
hi_in: फ़ील्ड (field) साइज़ 1 है लेकिन फ़ील्ड (field) type %d है
