Repository: Rdatatable/data.table
Catalog: hindi_files/frollR-*.po
Languages: hi_in

source: x must be of type numeric or logical, or a list, data.frame or data.table of such
hi_in: x का प्रकार संख्यात्मक या लॉजिकल (logical) होना चाहिए, या ऐसी लिस्ट (list), data.frame या data.table होना चाहिए

source: n must be non 0 length
hi_in: n की लेंथ (length) 0 से अधिक होनी चाहिए

source: %s must be TRUE or FALSE
hi_in: %s को TRUE या FALSE होना चाहिए

source: n must be integer, list is accepted for adaptive TRUE
hi_in: n को पूर्णांक (integer) होना चाहिए, लिस्ट (list) को adaptive TRUE के लिए स्वीकार किया जाता है

source: n must be integer
hi_in: n को पूर्णांक (integer) होना चाहिए

source: n must be positive integer values (> 0)
hi_in: n को सकारात्मक पूर्णांक (integer) मान (> 0) होना चाहिए

source: n must be integer vector or list of integer vectors
hi_in: n को पूर्णांक (integer) वेक्टर (vector) या पूर्णांक (integer) वेक्टर (vector) की लिस्ट (list) होना चाहिए।

source: hasNA must be TRUE, FALSE or NA
hi_in: hasNA को TRUE, FALSE या NA होना चाहिए

source: using hasNA FALSE and na.rm TRUE does not make sense, if you know there are NA values use hasNA TRUE, otherwise leave it as default NA
hi_in: hasNA FALSE और na.rm TRUE का उपयोग करने का कोई मतलब नहीं है, यदि आप जानते हैं किNA मान हैं तो hasNA TRUE का उपयोग करें, अन्यथा इसे डिफ़ॉल्ट (default) NA पर छोड़ दें

source: using adaptive TRUE and align argument different than 'right' is not implemented
hi_in: adaptive TRUE का उपयोग करते समय align आर्ग्युमेंट (argument) 'right' से अलग लागू नहीं किया गया है

source: %s: allocating memory for results %dx%d
hi_in: %s: परिणामों के लिए स्मृति आवंटित कर रहा है %dx%d

source: adaptive rolling function can only process 'x' having equal length of elements, like data.table or data.frame; If you want to call rolling function on list having variable length of elements call it for each field separately
hi_in: adaptive रोलिंग (rolling) फ़ंक्शन (function) केवल 'x' को समान लेंथ (length) वाले तत्वों के साथ प्रोसेस (process) कर सकता है, जैसे data.table या data.frame; यदि आप अलग-अलग लेंथ (length) के तत्वों वाली लिस्ट (list) पर कॉल (call) करना चाहते हैं, तो प्रत्येक फ़ील्ड (field) के लिए इसे अलग से कॉल (call) करें

source: length of integer vector(s) provided as list to 'n' argument must be equal to number of observations provided in 'x'
hi_in: 'n' आर्ग्युमेंट (argument) के लिए लिस्ट (list) के रूप में प्रदान किए गए पूर्णांक (integer) वेक्टर (vector) की लेंथ (length) 'x' में दी गई ऑब्ज़र्वेशन की संख्या के बराबर होनी चाहिए

source: fill must be a vector of length 1
hi_in: fill को लेंथ (length) 1 का वेक्टर (vector) होना चाहिए

source: fill must be numeric or logical
hi_in: fill को संख्यात्मक या लॉजिकल (logical) होना चाहिए

source: %s: %d column(s) and %d window(s), if product > 1 then entering parallel execution
hi_in: %s: %d कॉलम (column) और %d विंडो (window), यदि प्रोडक्ट (product) > 1 हैतो समानांतर निष्पादन में प्रवेश कर रहा है

source: %s: %d column(s) and %d window(s), not entering parallel execution here because algo='exact' will compute results in parallel
hi_in: %s: %d कॉलम (column) और %d विंडो (window), यहां समानांतर निष्पादन में प्रवेश नहीं कर रहा क्योंकि algo='exact' समानांतर में परिणामों की गणना करेगा

source: %s: processing of %d column(s) and %d window(s) took %.3fs
hi_in: %s: %d कॉलम (column) और %d विंडो (window) का प्रोसेसिंग (process) %.3fs में हुआ
