Repository: Rdatatable/data.table
Catalog: hindi_files/froll-*.po
Languages: hi_in

source: %s: window width longer than input vector, returning all NA vector
hi_in: %s: खिड़की की चौड़ाई इनपुट (input) वेक्टर (vector) से अधिक लंबी है, सभी NA वेक्टर (vector) लौटा रहा है

source: %s: align %d, shift answer by %d
hi_in: %s: संरेखित %d, उत्तर को %d से स्थानांतरित करें

source: %s: processing algo %u took %.3fs
hi_in: %s: एल्गोरिदम %u के संसाधन में %.3fs का समय लगा

source: %s: running for input length %<PRIu64>, window %d, hasna %d, narm %d
hi_in: %s: इनपुट (input) लंबाई %<PRIu64>, खिड़की %d, hasna %d, narm %d के लिए चल रहा है

source: %s: hasNA=FALSE used but NA (or other non-finite) value(s) are present in input, use default hasNA=NA to avoid this warning
hi_in: %s: hasNA=FALSE का उपयोग किया गया है लेकिन इनपुट (input) में NA (या अन्य गैर-परिमित) मान मौजूद हैं, इस चेतावनी (warning) से बचने के लिए डिफ़ॉल्ट (default) hasNA=NA का उपयोग करें

source: %s: NA (or other non-finite) value(s) are present in input, re-running with extra care for NAs
hi_in: %s: इनपुट (input) में NA (या अन्य गैर-परिमित) मान मौजूद हैं, NAs के लिए अतिरिक्त सावधानी के साथ पुन: निष्पादन किया जा रहा है

source: %s: NA (or other non-finite) value(s) are present in input, skip non-NA attempt and run with extra care for NAs
hi_in: %s: इनपुट (input) में NA (या अन्य गैर-परिमित) मान मौजूद हैं, गैर-NA प्रयास को छोड़ें और NAs के लिए अतिरिक्त सावधानी के साथ चलाएं

source: %s: running in parallel for input length %<PRIu64>, window %d, hasna %d, narm %d
hi_in: %s: इनपुट (input) लंबाई %<PRIu64>, खिड़की %d, hasna %d, narm %d के लिए समानांतर में चल रहा है

source: %s: NA (or other non-finite) value(s) are present in input, na.rm was FALSE so in 'exact' implementation NAs were handled already, no need to re-run
hi_in: %s: इनपुट (input) में NA (या अन्य गैर-परिमित) मान मौजूद हैं, na.rm FALSE था इसलिए 'यथातथ्य' कार्यान्वयन में NAs को पहले ही संभाल लिया गया था, पुन: निष्पादन की आवश्यकता नहीं है

source: %s: results from provided FUN are not length 1
hi_in: %s: प्रदान किए गए FUN के परिणाम की लेंथ (length) 1 नहीं है

source: %s: results from provided FUN are not of type double, coercion from integer or logical will be applied on each iteration
hi_in: %s: प्रदान किए गए FUN के परिणाम डबल (double) type के नहीं हैं, प्रत्येक पुनरावृत्ति पर इंटीजर (integer) या लॉजिकल (logical) से ज़बरदस्ती परिवर्तन लागू किया जाएगा

source: %s: results from provided FUN are not of type double
hi_in: %s: प्रदान किए गए FUN के परिणाम डबल (double) type के नहीं हैं

source: %s: took %.3fs
hi_in: %s: इसमें %.3fs का समय लगा
