Repository: Rdatatable/data.table
Catalog: hindi_files/fsort-*.po
Languages: hi_in

source: Reduced MSBsize from %zu to %zu by excluding 0 and 1 counts
hi_in: 0 और 1 की गणनाओं को छोड़कर MSBsize को %zu से %zu तक कम कर दिया गया

source: %s must be TRUE or FALSE
hi_in: %s TRUE या FALSE होना चाहिए

source: x must be a vector of type double currently
hi_in: x को वर्तमान में double प्रकार का वेक्टर (vector) होना चाहिए

source: Failed to allocate %d bytes in fsort().
hi_in: fsort() में %d बाइट्स (bytes) आवंटित करने में असफल।

source: Range = [%g,%g]
hi_in: रेंज = [%g,%g]

source: Cannot yet handle negatives.
hi_in: नकारात्मक संख्याओं को अभी तक संभाला नहीं जा सकता।

source: counts is %dMB (%d pages per nBatch=%d, batchSize=%<PRIu64>, lastBatchSize=%<PRIu64>)
hi_in: counts %dMB है (%d पेज (page) प्रति nBatch=%d, batchSize=%<PRIu64>,lastBatchSize=%<PRIu64>)

source: Top 20 MSB counts:
hi_in: शीर्ष 20 MSB गणनाएं:

source: OpenMP %d did not assign threads to iterations monotonically. Please search Stack Overflow for this message.
hi_in: OpenMP %d ने थ्रेड्स को क्रमिक रूप से इटरेशन (iterations) को असाइन (assign) नहीं किया।कृपया इस संदेश के लिए Stack Overflow पर खोजें।

source: Unable to allocate working memory
hi_in: कार्य स्मृति आवंटित करने में असमर्थ
