Repository: Rdatatable/data.table
Catalog: hindi_files/fwrite-*.po
Languages: hi_in

source: buffMB=%d outside [1,1024]
hi_in: buffMB=%d [1,1024] के बाहर है

source: eol must be 1 or more bytes (usually either \n or \r\n) but is length %d
hi_in: eol 1 या अधिक बाइट्स (bytes) का होना चाहिए (आमतौर पर \n या \r\n) लेकिन इसकी लेंथ (length) %d है

source: Column writers:
hi_in: कॉलम (column) लेखकों:

source: maxLineLen=%<PRIu64>. Found in %.3fs
hi_in: maxLineLen=%<PRIu64>. %.3fs में मिला

source: %s: '%s'. Failed to open existing file for writing. Do you have write permission to it? Is this Windows and does another process such as Excel have it open?
hi_in: %s: '%s'. लिखने के लिए मौजूदा फाइल (file) खोलने में विफल। क्या आपके पास इसके लिए लिखने की अनुमति है? क्या यह Windows है और क्या Excel जैसी किसी अन्य प्रक्रिया ने इसे खोल रखा है?

source: %s: '%s'. Unable to create new file for writing (it does not exist already). Do you have permission to write here, is there space on the disk and does the path exist?
hi_in: %s: '%s'. लिखने के लिए नई फाइल (file) बनाने में असमर्थ (यह पहले से मौजूद नहीं है)। क्या आपके पास यहाँ लिखने की अनुमति है, क्या डिस्क (disk) पर स्पेस (space) है और क्या पथ मौजूद है?

source: Compression in fwrite uses zlib library. Its header files were not found at the time data.table was compiled. To enable fwrite compression, please reinstall data.table and study the output for further guidance.
hi_in: fwrite में कंप्रेशन (compression) zlib लाइब्रेरी (library) का उपयोग करता है। इसके हेडर (header) फाइल्स (files) उस समय नहीं मिली थीं जब data.table को संकलित किया गया था। fwrite कंप्रेशन (compression) को सक्षम करने के लिए, कृपया data.table को रीइंस्टॉल (reinstall) करें और आगे के मार्गदर्शन के लिए आउटपुट (output) का अध्ययन करें।

source: Writing bom (%s), yaml (%d characters) and column names (%s) ...
hi_in: bom (%s), yaml (%d कैरेक्टर्स (characters)) और कॉलम (column) नाम (%s) लिखे जा रहे हैं ...

source: Unable to allocate %zu MiB for header: %s
hi_in: हेडर (header) के लिए %zu MiB आवंटित करने में असमर्थ: %s

source: Can't allocate gzip stream structure
hi_in: gzip प्रवाह संरचना आवंटित नहीं की जा सकती

source: Unable to allocate %zu MiB for zbuffer: %s
hi_in: zbuffer के लिए %zu MiB आवंटित करने में असमर्थ: %s

source: Compress gzip error: %d
hi_in: कंप्रेस (compress) gzip एरर (error): %d

source: done in %.3fs
hi_in: %.3fs में पूर्ण हुआ

source: No data rows present (nrow==0)
hi_in: कोई डेटा (data) रोज़ (rows) मौजूद नहीं हैं (nrow==0)

source: Writing %<PRId64> rows in %d batches of %d rows (each buffer size %dMB, showProgress=%d, nth=%d)
hi_in: %<PRId64> रोज़ (rows) को %d रोज़ (rows) के %d बैचों में लिखा जा रहा है (प्रत्येक बफर (buffer) साइज %dMB, showProgress=%d, nth=%d)

source: zbuffSize=%d returned from deflateBound
hi_in: deflateBound से zbuffSize=%d प्राप्त हुआ

source: Unable to allocate %zu MB * %d thread buffers; '%d: %s'. Please read ?fwrite for nThread, buffMB and verbose options.
hi_in: %zu MB * %d थ्रेड (thread) बफर्स (buffers) आवंटित करने में असमर्थ; '%d: %s'। कृपया nThread, buffMB और verbose विकल्पों के लिए ?fwrite पढ़ें।

source: Unable to allocate %zu MB * %d thread compressed buffers; '%d: %s'. Please read ?fwrite for nThread, buffMB and verbose options.
hi_in: %zu MB * %d थ्रेड (thread) कंप्रेस्ड (compressed) बफर्स (buffers) आवंटित करने में असमर्थ; '%d: %s'। कृपया nThread, buffMB और verbose विकल्पों के लिए ?fwrite पढ़ें।

source: Failed to allocated %d bytes for '%s'.
hi_in: '%s' के लिए %d बाइट्स (bytes) आवंटित करने में विफल।

source: zlib %s (zlib.h %s) deflate() returned error %d with z_stream->msg=="%s" Z_FINISH=%d Z_BLOCK=%d. %s
hi_in: zlib %s (zlib.h %s) deflate() से एरर (error) %d प्राप्त हुआ, z_stream->msg=="%s" Z_FINISH=%d Z_BLOCK=%d के साथ। %s

source: Please include the full output above and below this message in your data.table bug report.
hi_in: कृपया अपनी data.table बग (bug) रिपोर्ट (report) में इस संदेश के ऊपर और नीचे का पूर्ण आउटपुट (output) शामिल करें।

source: Please retry fwrite() with verbose=TRUE and include the full output with your data.table bug report.
hi_in: कृपया verbose=TRUE के साथ fwrite() का पुन: प्रयास करें और अपनी data.table बग (bug) रिपोर्ट (report) में पूर्ण आउटपुट (output) शामिल करें।
