Repository: Rdatatable/data.table
Catalog: hindi_files/R-bmerge-*.po
Languages: hi_in

source: %s is type %s which is not supported by data.table join
hi_in: %s type %s है, जो data.table join द्वारा समर्थित नहीं है।

source: Attempting roll join on factor column when joining %s to %s. Only integer, double or character columns may be roll joined.
hi_in: %s को %s से जोड़ते समय factor कॉलम पर roll join करने का प्रयास किया जा रहा है।केवल पूर्णांक (integer), डबल (double) या कैरेक्टर (character) कॉलम पर ही roll join किया जा सकता है।

source: Matching %s factor levels to %s factor levels.
hi_in: %s factor स्तरों को %s factor स्तरों से मिलाया जा रहा है।

source: Coercing factor column %s to type character to match type of %s.
hi_in: factor कॉलम %s को कैरेक्टर (character) type में परिवर्तित किया जा रहा है ताकि %s के type से मेल खा सके।

source: Matching character column %s to factor levels in %s.
hi_in: कैरेक्टर (character) कॉलम %s को %s में factor levels से मेल किया जा रहा है।

source: Incompatible join types: %s (%s) and %s (%s). Factor columns must join to factor or character columns.असंगत जॉइन (join) प्रकार: %s (%s) और %s (%s)। फ़ैक्टर (factor) कॉलम (column) केवल फ़ैक्टर (factor) या कैरेक्टर (character) कॉलम (column) से ही जोड़े जा सकते हैं।
hi_in: %s का type (%s) %s के समान है। कोई रूपांतरण आवश्यक नहीं।

source: Coercing all-NA %s (%s) to type %s to match type of %s.
hi_in: सभी-NA %s (%s) को type %s में रूपांतरित किया जा रहा है ताकि %s के type से मेल खा सके।

source: Incompatible join types: %s (%s) and %s (%s)
hi_in: असंगत join types: %s (%s) और %s (%s)

source: Coercing %s column %s%s to type integer64 to match type of %s.
hi_in: %s कॉलम %s%s को type integer64 में परिवर्तित किया जा रहा है ताकि %s के type से मेल खा सके।

source: Incompatible join types: %s is type integer64 but %s is type double and contains fractions
hi_in: असंगत join प्रकार: %s का type integer64 है, लेकिन %s का type double है औरइसमें भिन्नांश (fractions) शामिल हैं।

source: Coercing double column %s (which contains no fractions) to type integer to match type of %s.
hi_in: double कॉलम %s (जिसमें कोई भिन्नांश (fractions) नहीं है) को type integer में परिवर्तित किया जा रहा है ताकि%s के type से मेल खा सके।

source: Coercing integer column %s to type double to match type of %s which contains fractions.
hi_in: integer कॉलम %s को type double में परिवर्तित किया जा रहा है ताकि %s के type से मेल खा सके, जिसमेंभिन्नांश (fractions) हैं।

source: Coercing integer column %s to type double for join to match type of %s.
hi_in: जोइन (join) के लिए %s के प्रकार से मेल खाने के लिए integer कॉलम %s को डबल (double) type में बदला जा रहा है।

source: on= matches existing key, using key
hi_in: on= मौजूदा key से मेल खाता है, key का उपयोग करके

source: on= matches existing index, using index
hi_in: on= मौजूदा इंडेक्स (index) से मेल खाता है, इंडेक्स (index) का उपयोग करके

source: Calculated ad hoc index in %s
hi_in: %s में ad hoc इंडेक्स (index) की गणना की गई

source: Non-equi join operators detected ...
hi_in: non-equi join ऑपरेटर (operators) का पता चला ...

source: roll is not implemented for non-equi joins yet.
hi_in: non-equi joins के लिए अभी तक रोल (roll) लागू नहीं किया गया है।

source: forder took ...
hi_in: forder ने लिया ...

source: Generating group lengths ...
hi_in: समूह लेंथ्स (lengths) उत्पन्न कर रहे हैं ...

source: done in %s
hi_in: %s में पूरा हुआ

source: Generating non-equi group ids ...
hi_in: non-equi समूह ids उत्पन्न कर रहे हैं ...

source: Column name '_nqgrp_' is reserved for non-equi joins.
hi_in: कॉलम (column) नाम 'nqgrp' non-equi joins के लिए आरक्षित है।

source: Recomputing forder with non-equi ids ...
hi_in: non-equi ids के साथ forder की फिर से गणना की जा रही है ...

source: Starting bmerge ...
hi_in: bmerge शुरू हो रहा है ...

source: bmerge done in %s
hi_in: bmerge %s में पूरा हुआ

source: Found %d non-equi group ...
hi_in: %d non-equi समूह मिला ...
