Repository: Rdatatable/data.table
Catalog: hindi_files/R-data.table-*.po
Languages: hi_in

source: key argument of data.table() must be character
hi_in: data.table() का key आर्ग्युमेंट (argument) कैरेक्टर (character) होना चाहिए

source: Object '%s' not found. Perhaps you intended %s
hi_in: ऑब्जेक्ट (Object) '%s' नहीं मिला। शायद आप %s का उपयोग करना चाहते थे

source: Object '%s' not found amongst %s
hi_in: ऑब्जेक्ट (Object) '%s' %s में नहीं मिला

source: [ was called on a data.table in an environment that is not data.table-aware (i.e. cedta()), but '%s' was used, implying the owner of this call really intended for data.table methods to be called. See vignette('datatable-importing') for details on properly importing data.table.
hi_in: data.table में [ का कॉल (call) ऐसे वातावरण में किया गया जो data.table से अवगत नहीं है (जैसे cedta()), लेकिन '%s' का उपयोग किया गया है, जो दर्शाता है कि इस कॉल (call) के मालिक ने वास्तव में data.table विधि को कॉल (call) करने का इरादा किया था। सही तरीके से data.table को आयात करने के लिए vignette('datatable-importing') देखें।

source: verbose must be logical or integer
hi_in: verbose लॉजिकल (logical) या पूर्णांक (integer) होना चाहिए।

source: verbose must be length 1 non-NA
hi_in: verbose की length 1 होनी चाहिए और यह non-NA होना चाहिए।

source: Ignoring by/keyby because 'j' is not supplied
hi_in: j' प्रदान नहीं किया गया है, इसलिए by/keyby को अनदेखा किया जा रहा है।

source: When by and keyby are both provided, keyby must be TRUE or FALSE
hi_in: जब by और keyby दोनों प्रदान किए जाते हैं, तो keyby TRUE या FALSE होना चाहिए।

source: Argument '%s' after substitute: %s
hi_in: सब्स्टिटूट (substitute) के बाद आर्ग्युमेंट (argument) '%s': %s

source: When on= is provided but not i=, on= must be a named list or data.table|frame, and a natural join (i.e. join on common names) is invoked. Ignoring on= which is '%s'.
hi_in: जब on= प्रदान किया जाता है लेकिन i= नहीं, तो on= को एक नामांकित लिस्ट (named list) या data.table|फ्रेम (frame) होना चाहिए और एक प्राकृतिक जॉइन (join) को प्रेरित किया जाता है (जैसे सामान्य नामों पर जॉइन)। on= को अनदेखा किया जा रहा है, जो '%s' है।

source: i and j are both missing so ignoring the other arguments. This warning will be upgraded to error in future.
hi_in: i और j दोनों अनुपस्थित हैं, इसलिए अन्य आर्ग्युमेंट्स (arguments) को अनदेखा किया जा रहा है। यह चेतावनी भविष्य में एरर (error) में बदल दी जाएगी।

source: mult argument can only be 'first', 'last' or 'all'
hi_in: mult आर्ग्युमेंट (argument) केवल 'first', 'last' या 'all' हो सकता है।

source: roll must be a single TRUE, FALSE, positive/negative integer/double including +Inf and -Inf or 'nearest'
hi_in: roll एकल TRUE, FALSE, सकारात्मक/नकारात्मक पूर्णांक (integer)/डबल (double) होना चाहिए, जिसमें +Inf और -Inf शामिल हों, या 'nearest'।

source: roll is '%s' (type character). Only valid character value is 'nearest'.
hi_in: roll '%s' (प्रकार कैरेक्टर (character)) है। केवल मान्य कैरेक्टर (character) मान 'nearest' है।

source: rollends must be a logical vector
hi_in: rollends एक लॉजिकल (logical) वेक्टर (vector) होना चाहिए।

source: rollends must be length 1 or 2
hi_in: rollends की लेंथ length 1 या 2 होनी चाहिए।

source: nomatch= must be either NA or NULL (or 0 for backwards compatibility which is the same as NULL but please use NULL)
hi_in: nomatch= या तो NA या NULL (या पिछड़े संगतता के लिए 0, जो NULL के समान है, लेकिन कृपया NULL का उपयोग करें) होना चाहिए।

source: which= must be a logical vector length 1. Either FALSE, TRUE or NA.
hi_in: which= एक लॉजिकल (logical) वेक्टर (vector) length 1 होना चाहिए। या तो FALSE, TRUE या NA।

source: which==%s (meaning return row numbers) but j is also supplied. Either you need row numbers or the result of j, but only one type of result can be returned.
hi_in: which==%s (अर्थात पंक्ति (row) संख्या लौटाना) लेकिन j भी प्रदान किया गया है। या तो आपको पंक्ति (row) संख्या चाहिए या j का परिणाम, लेकिन केवल एक प्रकार का परिणाम लौटाया जा सकता है।

source: which=NA with nomatch=0|NULL would always return an empty vector. Please change or remove either which or nomatch.
hi_in: which=NA और nomatch=0|NULL के साथ हमेशा एक खाली वेक्टर (vector) लौटाया जाएगा। कृपया which या nomatch को बदलें या हटा दें।

source: j must be provided when with=FALSE
hi_in: जब with=FALSE होता है तो j प्रदान किया जाना चाहिए।

source: %s must be TRUE or FALSE
hi_in: %s TRUE या FALSE होना चाहिए।

source: The symbol .. is invalid. The .. prefix must be followed by at least one character.
hi_in: प्रतीक .. अमान्य है। .. उपसर्ग के बाद कम से कम एक कैरेक्टर (character) होना चाहिए।

source: Variable '..%s' does exist in calling scope though, so please just removed the .. prefix from that variable name in calling scope.
hi_in: वेरिएबल (variable) '..%s' कॉलिंग (call) दायरा में मौजूद है, इसलिए कृपया उस वेरिएबल (variable) नाम से .. उपसर्ग को हटा दें।

source: Variable '%s' is not found in calling scope. Looking in calling scope because you used the .. prefix.%s
hi_in: वेरिएबल (variable) '%s' कॉलिंग (call) दायरा में नहीं मिला। कॉलिंग (call) दायरा में खोज की जा रही है क्योंकि आपने .. उपसर्ग का उपयोग किया है। %s

source: Both '%1$s' and '..%1$s' exist in calling scope. Please remove the '..%1$s' variable in calling scope for clarity.
hi_in: कॉलिंग (call) दायरा में '%1$s' और '..%1$s' दोनों मौजूद हैं। कृपया स्पष्टता के लिए कॉलिंग (call) दायरा में '..%1$s' वेरिएबल (variable) को हटा दें।

source: Variable '%s' is not found in calling scope. Looking in calling scope because you set with=FALSE. Also, please use .. symbol prefix and remove with=FALSE.
hi_in: वेरिएबल (variable) '%s' कॉलिंग (call) दायरा में नहीं मिला। कॉलिंग (call) दायरा में खोज की जा रही है क्योंकि आपने with=FALSE सेट किया है। साथ ही, कृपया .. प्रतीक उपसर्ग का उपयोग करें और with=FALSE को हटा दें।

source: You have wrapped := with {} which is ok but then := must be the only thing inside {}. You have something else inside {} as well. Consider placing the {} on the RHS of := instead; e.g. DT[,someCol:={tmpVar1<-...;tmpVar2<-...;tmpVar1*tmpVar2}]
hi_in: आपने := को {} के साथ लपेटा है, जो ठीक है, लेकिन फिर := को {} के अंदर केवल एकमात्र चीज़ होना चाहिए। आपके पास {} के अंदर कुछ और भी है। इसके बजाय := के RHS पर {} रखने पर विचार करें; जैसे: DT[,someCol:={tmpVar1<-...;tmpVar2<-...;tmpVar1tmpVar2}]

source: := with keyby is only possible when i is not supplied since you can't setkey on a subset of rows. Either change keyby to by or remove i
hi_in: := के साथ keyby केवल तभी संभव है जब i प्रदान नहीं किया गया हो क्योंकि आप पंक्ति (row)यों के सबसेट (subset) पर setkey नहीं कर सकते। या तो keyby को by में बदलें या i को हटा दें।

source: nomatch isn't relevant together with :=, ignoring nomatch
hi_in: nomatch := के साथ प्रासंगिक नहीं है, nomatch को नजरअंदाज किया जा रहा है।

source: not-join '!' prefix is present on i but nomatch is provided. Please remove nomatch.
hi_in: i पर not-join '!' उपसर्ग मौजूद है लेकिन nomatch दिया गया है। कृपया nomatch को हटा दें।

source: Operator := detected in i, the first argument inside DT[...], but is only valid in the second argument, j. Most often, this happens when forgetting the first comma (e.g. DT[newvar := 5] instead of DT[ , new_var := 5]). Please double-check the syntax. Run traceback(), and debugger() to get a line number.
hi_in: ऑपरेटर (operator) := i में पाया गया, DT[...] के अंदर पहला आर्ग्युमेंट (argument), लेकिन यह केवल दूसरे आर्ग्युमेंट (argument), j में मान्य है। अक्सर, यह पहले कॉमा (comma) को भूलने पर होता है (जैसे DT[newvar := 5] के बजाय DT[, new_var := 5])। कृपया सिंटैक्स (syntax) की दोबारा जांच करें। लाइन नंबर प्राप्त करने के लिए traceback() और debugger() चलाएं।

source: '%s' is not found in calling scope and it is not a column name either
hi_in: %s' कॉलिंग (call) दायरा में नहीं पाया गया है और यह कॉलम (column) का नाम भी नहीं है।

source: '%s' is not found in calling scope, but it is a column of type %s. If you wish to select rows where that column contains TRUE, or perhaps that column contains row numbers of itself to select, try DT[(col)], DT[DT$col], or DT[col==TRUE] is particularly clear and is optimized
hi_in: %s' कॉलिंग (call) दायरा में नहीं पाया गया, लेकिन यह प्रकार %s का कॉलम (column) है। यदि आप पंक्ति (row)यों का चयन करना चाहते हैं जहां वह कॉलम (column) TRUE हो, या शायद वह कॉलम (column) अपनी पंक्ति (row) संख्या शामिल करता है, तो DT[(col)], DT[DT$col], या DT[col==TRUE] का उपयोग करें, यह विशेष रूप से स्पष्ट है और अनुकूलित है।

source: %s. When the first argument inside DT[...] is a single symbol (e.g. DT[var]), data.table looks for var in calling scope.
hi_in: %s। जब DT[...] के अंदर पहला आर्ग्युमेंट (argument) एकल प्रतीक होता है (जैसे DT[var]), data.table कॉलिंग (call) दायरा में var की तलाश करता है।

source: i is invalid type (matrix). Perhaps in future a 2 column matrix could return a list of elements of DT (in the spirit of A[B] in FAQ 2.14). Please report to data.table issue tracker if you'd like this, or add your comments to FR #657.
hi_in: i अमान्य प्रकार (मैट्रिक्स (matrix)) है। शायद भविष्य में 2 कॉलम (column) मैट्रिक्स (matrix) DT के तत्वों की लिस्ट (list) लौटा सकती है (FAQ 2.14 में A[B] की भावना में)। यदि आप इसे चाहें, तो कृपया data.table इशू ट्रैकर (tracker) पर रिपोर्ट करें, या FR #657 पर अपनी टिप्पणियां जोड़ें।

source: When i is a data.table (or character vector), the columns to join by must be specified using 'on=' argument (see ?data.table), by keying x (i.e. sorted, and, marked as sorted, see ?setkey), or by sharing column names between x and i (i.e., a natural join). Keyed joins might have further speed benefits on very large data due to x being sorted in RAM.
hi_in: जब i एक data.table (या कैरेक्टर वेक्टर (character vector)) होता है, तो कॉलम (column) को 'on=' आर्ग्युमेंट (argument) का उपयोग करके निर्दिष्ट किया जाना चाहिए (देखें ?data.table), x को key बनाकर (यानी, सॉर्ट किया गया और, सॉर्ट किया गया चिह्नित, ?setkey देखें), या x और i के बीच कॉलम (column) नाम साझा करके (यानी, एक प्राकृतिक जॉइन)। बहुत बड़े डेटा पर key-आधारित जॉइन RAM में x के सॉर्ट किए जाने के कारण आगे की गति लाभ प्रदान कर सकते हैं।

source: Attempting to do natural join but no common columns in provided tables
hi_in: प्राकृतिक जॉइन (join) करने का प्रयास किया जा रहा है, लेकिन दिए गए टेबल में कोई सामान्य कॉलम (column) नहीं है।

source: Joining but 'x' has no key, natural join using all 'x' columns
hi_in: जॉइन (join) कर रहा है लेकिन 'x' में कोई key नहीं है, सभी 'x' कॉलम (column) का उपयोग करके प्राकृतिक जॉइन (join)।

source: Joining but 'x' has no key, natural join using: %s
hi_in: जॉइन (join) कर रहा है लेकिन 'x' में कोई key नहीं है, प्राकृतिक जॉइन (join) का उपयोग कर रहा है: %s।

source: not-join called with 'by=.EACHI'; Replacing !i with i=setdiff_(x,i) ...
hi_in: not-join 'by=.EACHI' के साथ कॉल (call) किया गया; !i को i=setdiff_(x,i) से बदल रहा है ...

source: done in %s
hi_in: %s में पूरा हुआ।

source: Constructing irows for '!byjoin || nqbyjoin' ...
hi_in: !byjoin || nqbyjoin' के लिए irows का निर्माण कर रहा है ...

source: Reorder irows for 'mult=="all" && !allGrp1' ...
hi_in: mult=='all' && !allGrp1' के लिए irows को पुनः व्यवस्थित कर रहा है ...

source: Reordering %d rows after bmerge done in ...
hi_in: bmerge के बाद %d पंक्ति (row)यों का पुनः क्रमबद्ध कर रहा है ...

source: logical error. i is not a data.table, but 'on' argument is provided.
hi_in: लॉजिकल एरर (logical error)। i एक data.table नहीं है, लेकिन 'on' आर्ग्युमेंट (argument) दिया गया है।

source: i has evaluated to type %s. Expecting logical, integer or double.
hi_in: i का प्रकार %s के रूप में मूल्यांकन किया गया है। लॉजिकल, पूर्णांक (integer) या डबल (double) की अपेक्षा है।

source: i evaluates to a logical vector length %d but there are %d rows. Recycling of logical i is no longer allowed as it hides more bugs than is worth the rare convenience. Explicitly use rep(...,length=.N) if you really need to recycle.
hi_in: i को लॉजिकल (logical) वेक्टर (vector) लेंथ (length) %d के रूप में मूल्यांकित किया गया है, लेकिन %d पंक्ति (row)याँ हैं। लॉजिकल (logical) i का पुनः उपयोग अब अनुमति नहीं है क्योंकि यह दुर्लभ सुविधा से अधिक बग छुपाता है। यदि आपको पुनः उपयोग करना आवश्यक है, तो स्पष्ट रूप से rep(...,length=.N) का उपयोग करें।

source: Please use nomatch=NULL instead of nomatch=0; see news item 5 in v1.12.0 (Jan 2019)
hi_in: कृपया nomatch=0 के बजाय nomatch=NULL का उपयोग करें; v1.12.0 (जनवरी 2019) में समाचार आइटम (item) 5 देखें।

source: Inverting irows for notjoin done in ...
hi_in: notjoin के लिए irows को उलटने का कार्य पूरा हुआ ...

source: with=FALSE together with := was deprecated in v1.9.4 released Oct 2014. Please wrap the LHS of := with parentheses; e.g., DT[,(myVar):=sum(b),by=a] to assign to column name(s) held in variable myVar. See ?':=' for other examples. As warned in 2014, this is now a warning.
hi_in: v1.9.4 (अक्टूबर 2014) में with=FALSE और := को साथ में प्रयोग करना अप्रचलित कर दिया गया था। कृपया := के LHS को कोष्ठकों में रखें; जैसे, DT[,(myVar):=sum(b),by=a] का उपयोग करके कॉलम (column) नाम को वैरिएबल (variable) myVar में असाइन (assign) करें। अन्य उदाहरणों के लिए ?':=' देखें। 2014 में चेतावनी दी गई थी, यह अब एक चेतावनी है।

source: with=FALSE ignored, it isn't needed when using :=. See ?':=' for examples.
hi_in: with=FALSE को अनदेखा कर दिया गया है, := का उपयोग करते समय इसकी आवश्यकता नहीं है। उदाहरणों के लिए ?':=' देखें।

source: Item %d of j is %d which is outside the column number range [1,ncol=%d]
hi_in: j का आइटम (item) %d, %d है जो कॉलम (column) नंबर रेंज [1,ncol=%d] के बाहर है।

source: j mixes positives and negatives
hi_in: j सकारात्मक और नकारात्मक को मिलाता है।

source: When with=FALSE, j-argument should be of type logical/character/integer indicating the columns to select.
hi_in: जब with=FALSE होता है, तो j-आर्ग्युमेंट (argument) लॉजिकल (logical)/कैरेक्टर (character)/पूर्णांक प्रकार का होना चाहिए जो चयनित कॉलम (column) को इंगित करता है।

source: 'by' contains .I but only the following are currently supported: by=.I, by=.(.I), by=c(.I), by=list(.I)
hi_in: by' में .I शामिल है, लेकिन वर्तमान में केवल निम्नलिखित का समर्थन है: by=.I, by=.(.I), by=c(.I), by=list(.I)

source: by=c(...), key(...) or names(...) must evaluate to 'character'
hi_in: by=c(...), key(...) या names(...) का मूल्यांकन 'कैरेक्टर (character)' में होना चाहिए।

source: 'by' is a character vector length %d but one or more items include a comma. Either pass a vector of column names (which can contain spaces, but no commas), or pass a vector length 1 containing comma separated column names. See ?data.table for other possibilities.
hi_in: by' एक कैरेक्टर (character) वेक्टर (vector) लेंथ (length) %d है, लेकिन एक या अधिक आइटम (item) में कॉमा (comma) शामिल है। या तो कॉलम (column) नामों वाला वेक्टर (vector) पास करें (जिसमें स्पेस हो सकते हैं, लेकिन कॉमा (comma) नहीं), या कॉमा (comma) सेपरेटेड (separated) कॉलम (column) नामों वाली लेंथ (length) 1 का वेक्टर (vector) पास करें। अन्य संभावनाओं के लिए ?data.table देखें।

source: At least one entry of by is empty
hi_in: by में कम से कम एक प्रविष्टि खाली है।

source: by index '%s' but that index has 0 length. Ignoring.
hi_in: by index '%s' है लेकिन उस index की लेंथ (length) 0 है। इसे अनदेखा कर रहा है।

source: i clause present and columns used in by detected, only these subset: %s
hi_in: i क्लॉज (clause) मौजूद है और by में उपयोग किए गए कॉलम (column) का पता लगाया गया है, केवल यह सबसेट (subset): %s।

source: i clause present but columns used in by not detected. Having to subset all columns before evaluating 'by': '%s'
hi_in: i क्लॉज (clause) मौजूद है लेकिन by में उपयोग किए गए कॉलम (column) का पता नहीं चला। 'by' का मूल्यांकन करने से पहले सभी कॉलम (column) को सबसेट (subset) बनाना होगा: '%s'।

source: 'by' appears to evaluate to column names but isn't c() or key(). Use by=list(...) if you can. Otherwise, by=eval%s should work. This is for efficiency so data.table can detect which columns are needed.
hi_in: by' कॉलम (column) नामों का मूल्यांकन करता प्रतीत होता है, लेकिन यह c() या key() नहीं है। यदि संभव हो, तो by=list(...) का उपयोग करें। अन्यथा, by=eval%s कार्य करना चाहिए। यह दक्षता के लिए है ताकि data.table यह पहचान सके कि किन कॉलमों (column) की आवश्यकता है।

source: 'by' or 'keyby' must evaluate to a vector or a list of vectors (where 'list' includes data.table and data.frame which are lists, too)
hi_in: by' या 'keyby' का मूल्यांकन एक वेक्टर (vector) या वेक्टरों (vector) की सूची के रूप में होना चाहिए (जहां 'लिस्ट' में data.table और data.frame भी शामिल हैं, जो लिस्ट (list) हैं)।

source: Column or expression %d of 'by' or 'keyby' is type '%s' which is not currently supported. If you have a compelling use case, please add it to https://github.com/Rdatatable/data.table/issues/1597. As a workaround, consider converting the column to a supported type, e.g. by=sapply(list_col, toString), whilst taking care to maintain distinctness in the process.
hi_in: by' या 'keyby' का कॉलम (column) या अभिव्यक्ति %d प्रकार '%s' है, जो वर्तमान में समर्थित नहीं है। यदि आपके पास एक महत्वपूर्ण उपयोग का मामला है, तो कृपया इसे https://github.com/Rdatatable/data.table/issues/1597 पर जोड़ें। एक कारगर युक्ति के रूप में, कॉलम (column) को समर्थित प्रकार में बदलने पर विचार करें, उदाहरण के लिए by=sapply(list_col, toString), इस प्रक्रिया में विशिष्टता बनाए रखने का ध्यान रखते हुए।

source: %s Each must be length %d; the same length as there are rows in x (after subsetting if i is provided).
hi_in: %s प्रत्येक की लेंथ (length) %d होनी चाहिए; x में पंक्तियों (row) की समान लेंथ (length) (यदि i दिया गया है तो सबसेट (subset) बनाने के बाद)।

source: by-expression '%s' is not named, and the auto-generated name '%s' clashed with variable(s) in j. Therefore assigning the entire by-expression as name.
hi_in: by-अभिव्यक्ति '%s' का नाम नहीं है, और स्वचालित रूप से उत्पन्न नाम '%s' j में वैरिएबल (variable)(s) के साथ टकरा गया। इसलिए संपूर्ण by-अभिव्यक्ति को नाम के रूप में असाइन (assign) कर रहा है।

source: Item %d of the .() or list() passed to j is missing
hi_in: .() या list() का आइटम (item) %d, जो j को पास किया गया है, गायब है।

source: j may not evaluate to the same number of columns for each group; if you're sure this warning is in error, please put the branching logic outside of [ for efficiency
hi_in: j प्रत्येक समूह के लिए समान संख्या में कॉलम (column) का मूल्यांकन नहीं कर सकता; यदि आपको यकीन है कि यह चेतावनी त्रुटि में है, तो कृपया शाखा-तर्क को दक्षता के लिए [ के बाहर रखें।

source: Different branches of j expression produced different auto-named columns: %s; using the most "last" names. If this was intentional (e.g., you know only one branch will ever be used in a given query because the branch is controlled by a function argument), please (1) pull this branch out of the call; (2) explicitly provide missing defaults for each branch in all cases; or (3) use the same name for each branch and re-name it in a follow-up call.
hi_in: j अभिव्यक्ति की विभिन्न शाखाओं ने विभिन्न स्वचालित नामित कॉलम (column) बनाए: %s; सबसे "अंतिम" नामों का उपयोग कर रहा है। यदि यह जानबूझकर किया गया था (उदाहरण के लिए, आपको पता है कि किसी दिए गए क्वेरी (query) में केवल एक शाखा का ही उपयोग किया जाएगा क्योंकि शाखा को एक फ़ंक्शन (function) आर्ग्युमेंट (argument) द्वारा नियंत्रित किया जाता है), तो कृपया (1) इस शाखा को कॉल (call) से बाहर निकालें; (2) प्रत्येक मामले में प्रत्येक शाखा के लिए स्पष्ट रूप से गायब डिफ़ॉल्ट्स (default) प्रदान करें; या (3) प्रत्येक शाखा के लिए समान नाम का उपयोग करें और इसे एक अनुवर्ती कॉल (call) में पुनः नामित करें।

source: When .SDcols is a function, it is applied to each column; the output of this function must be a non-missing boolean scalar signalling inclusion/exclusion of the column. However, these conditions were not met for: %s
hi_in: जब .SDcols एक फ़ंक्शन (function) है, तो इसे प्रत्येक कॉलम (column) पर लागू किया जाता है; इस फ़ंक्शन (function) का आउटपुट (output) एक गैर-गायब बूलियन (boolean) स्केलर (scalar) होना चाहिए जो कॉलम (column) के सम्मिलन/बहिष्करण का संकेत देता हो। हालांकि, ये शर्तें इसके लिए पूरी नहीं हुईं: %s।

source: .SDcols missing at the following indices: %s
hi_in: .SDcols निम्नलिखित इंडेक्स (indices) पर गायब है: %s।

source: .SDcols is a logical vector of length %d but there are %d columns
hi_in: .SDcols की लेंथ (length) %d का एक लॉजिकल (logical) वेक्टर (vector) है, लेकिन कॉलम (column) की संख्या %d है।

source: .SDcols is numeric but has both +ve and -ve indices
hi_in: .SDcols संख्यात्मक है लेकिन इसमें सकारात्मक और नकारात्मक दोनों इंडेक्स (indices) हैं।

source: .SDcols is numeric but out of bounds [1, %d] at: %s
hi_in: .SDcols संख्यात्मक है लेकिन [1, %d] की सीमा से बाहर है: %s।

source: .SDcols should be column numbers or names
hi_in: .SDcols कॉलम (column) संख्या या नाम होना चाहिए।

source: Some items of .SDcols are not column names: %s
hi_in: .SDcols के कुछ आइटम (item) कॉलम (column) नाम नहीं हैं: %s।

source: '(m)get' found in j. ansvars being set to all columns. Use .SDcols or a single j=eval(macro) instead. Both will detect the columns used which is important for efficiency. Old ansvars: %s
hi_in: (m)get' j में पाया गया। ansvars को सभी कॉलम (column) पर सेट किया जा रहा है। इसके बजाय .SDcols या एकल j=eval(macro) का उपयोग करें। दोनों उपयोग किए गए कॉलम (column) का पता लगाएंगे जो दक्षता के लिए महत्वपूर्ण हैं। पुराने ansvars: %s।

source: New ansvars: %s
hi_in: नए ansvars: %s।

source: This j doesn't use .SD but .SDcols has been supplied. Ignoring .SDcols. See ?data.table.
hi_in: यह j .SD का उपयोग नहीं करता है, लेकिन .SDcols प्रदान किया गया है। .SDcols को अनदेखा कर रहा है। देखें ?data.table।

source: Detected that j uses these columns: %s
hi_in: पता चला कि j इन कॉलम (column) का उपयोग करता है: %s।

source: .SD is locked. Using := in .SD's j is reserved for possible future use; a tortuously flexible way to modify by group. Use := in j directly to modify by group by reference.
hi_in: .SD लॉक है। .SD के j में := का उपयोग संभावित भविष्य के उपयोग के लिए आरक्षित है; समूह द्वारा संशोधित करने का एक जटिल लचीला तरीका। समूह द्वारा संदर्भ से संशोधित करने के लिए j में सीधे := का उपयोग करें।

source: In %s(col1=val1, col2=val2, ...) form, all arguments must be named.
hi_in: %s(col1=val1, col2=val2, ...) रूप में, सभी आर्ग्युमेंट (argument) का नाम होना चाहिए।

source: In %s(col1=val1, col2=val2, ...) form, all arguments must be named, but the last argument has no name. Did you forget a trailing comma?
hi_in: %s(col1=val1, col2=val2, ...) रूप में, सभी आर्ग्युमेंट (argument) का नाम होना चाहिए, लेकिन अंतिम आर्ग्युमेंट (argument) का नाम नहीं है। क्या आपने अंतिम कॉमा (comma) जोड़ना भूल गए?

source: In %s(col1=val1, col2=val2, ...) form, all arguments must be named, but these arguments lack names: %s.
hi_in: %s(col1=val1, col2=val2, ...) रूप में, सभी आर्ग्युमेंट (argument) का नाम होना चाहिए, लेकिन इन आर्ग्युमेंट (argument) में नाम नहीं है: %s।

source: LHS of := must be a symbol, or an atomic vector (column names or positions).
hi_in: := का LHS एक प्रतीक, या एक एटॉमिक (atomic) वेक्टर (vector) (कॉलम (column) नाम या स्थिति) होना चाहिए।

source: LHS of := appears to be column positions but are outside [1,ncol] range. New columns can only be added by name.
hi_in: := का LHS कॉलम (column) की स्थिति प्रतीत होता है लेकिन [1,ncol] सीमा से बाहर है। नए कॉलम (column) केवल नाम द्वारा जोड़े जा सकते हैं।

source: LHS of := isn't column names ('character') or positions ('integer' or 'numeric')
hi_in: := का LHS कॉलम (column) नाम ('कैरेक्टर (character)') या स्थिति ('पूर्णांक' या 'संख्यात्मक') नहीं है।

source: No rows match i. No new columns to add so not evaluating RHS of := Assigning to 0 row subset of %d rows
hi_in: कोई पंक्ति (row)यां i से मेल नहीं खाती हैं। कोई नया कॉलम (column) जोड़ने के लिए नहीं है, इसलिए := के RHS का मूल्यांकन नहीं किया जा रहा है %d पंक्तियों (row) के 0 पंक्ति (row) उपसमूह को असाइन (assign) किया जा रहा है।
