Repository: Rdatatable/data.table
Catalog: hindi_files/R-data.table-*.po
Languages: hi_in

source: Invalid .internal.selfref detected and fixed by taking a (shallow) copy of the data.table so that := can add this new column by reference. At an earlier point, this data.table has been copied by R (or was created manually using structure() or similar). Avoid names<- and attr<- which in R currently (and oddly) may copy the whole data.table. Use set* syntax instead to avoid copying: ?set, ?setnames and ?setattr. If this message doesn't help, please report your use case to the data.table issue tracker so the root cause can be fixed or this message improved.
hi_in: अवैध .internal.selfref का पता चला और इसे data.table की एक (शैलो (shallow)) कॉपी (copy) लेने से ठीक किया गया ताकि := इस नए कॉलम (column) को संदर्भ द्वारा जोड़ सके। पहले के किसी बिंदु पर, इस data.table को R द्वारा कॉपी (copy) किया गया था (या structure() या इसी तरह के उपयोग से मैन्युअल (manually) रूप से बनाया गया था)। नाम<- और attr<- से बचें जो वर्तमान में R में (और अजीब तरीके से) पूरे data.table की कॉपी (copy) कर सकते हैं। कॉपी (copy) करने से बचने के लिए set* सिंटैक्स (syntax) का उपयोग करें: ?set, ?setnames और ?setattr। यदि यह संदेश मदद नहीं करता है, तो कृपया अपने उपयोग के मामले को data.table इशू ट्रैकर (tracker) में रिपोर्ट करें ताकि मूल कारण को ठीक किया जा सके या इस संदेश को बेहतर किया जा सके।

source: Growing vector of column pointers from truelength %d to %d. A shallow copy has been taken, see ?setalloccol. Only a potential issue if two variables point to the same data (we can't yet detect that well) and if not you can safely ignore this. To avoid this message you could setalloccol() first, deep copy first using copy(), wrap with suppressWarnings() or increase the 'datatable.alloccol' option.
hi_in: कॉलम (column) पॉइंटर्स (pointers) के ट्रूलेंथ %d से %d तक बढ़ने के कारण शैलो (shallow) कॉपी (copy) ली गई है, देखें ?setalloccol। केवल संभावित मुद्दा अगर दो वेरिएबल्स एक ही डेटा की ओर इशारा करते हैं (हम अभी तक इसे अच्छी तरह से नहीं पकड़ सकते हैं) और यदि ऐसा नहीं है तो आप इसे सुरक्षित रूप से अनदेखा कर सकते हैं। इस संदेश से बचने के लिए आप पहले setalloccol() का उपयोग कर सकते हैं, पहले कॉपी (copy)() का उपयोग करके गहरी कॉपी (copy) करें, suppressWarnings() के साथ रैप करें या 'datatable.alloccol' विकल्प को बढ़ाएं।

source: Note that the shallow copy will assign to the environment from which := was called. That means for example that if := was called within a function, the original table may be unaffected.
hi_in: ध्यान दें कि शैलो (shallow) कॉपी (copy) उस वातावरण को असाइन (assign) करेगी जिससे := को कॉल (call) किया गया था। इसका मतलब है कि यदि := को किसी फ़ंक्शन (function) के भीतर कॉल (call) किया गया था, तो मूल तालिका अप्रभावित रह सकती है।

source: Cannot assign to an under-allocated recursively indexed list -- L[[i]][,:=] syntax is only valid when i is length 1, but its length is %d
hi_in: कम-आवंटित पुनरावर्ती अनुक्रमित लिस्ट (list) को असाइन (assign) नहीं किया जा सकता है -- L[[i]][,:=] सिंटैक्स (syntax) केवल तब मान्य होता है जब i की लेंथ (length) 1 हो, लेकिन इसकी लेंथ (length) %d है।

source: Variable '%s' is not found in calling scope. Looking in calling scope because this symbol was prefixed with .. in the j= parameter.
hi_in: कॉलिंग (call) दायरा में वैरिएबल (variable) '%s' नहीं मिला। j= पैरामीटर (parameter) में इस प्रतीक के साथ .. उपसर्ग होने के कारण कॉलिंग (call) दायरा में देख रहा हूं।

source: j (the 2nd argument inside [...]) is a single symbol but column name '%1$s' is not found. If you intended to select columns using a variable in calling scope, please try DT[, ..%1$s]. The .. prefix conveys one-level-up similar to a file system path.
hi_in: j ( [... ] के भीतर दूसरा तर्क) एक एकल प्रतीक है, लेकिन कॉलम (column) नाम '%1$s' नहीं मिला। यदि आपने कॉलिंग (call) दायरा में वैरिएबल (variable) का उपयोग करके कॉलम (column) चुनने का इरादा किया था, तो कृपया DT[, ..%1$s] का प्रयास करें। .. उपसर्ग एक फाइल (file) सिस्टम (system) पथ के समान एक स्तर ऊपर का संकेत देता है।

source: The column '.N' can't be grouped because it conflicts with the special .N variable. Try setnames(DT,'.N','N') first.
hi_in: कॉलम (column) '.N' को समूहबद्ध नहीं किया जा सकता क्योंकि यह विशेष .N वैरिएबल (variable) के साथ टकराता है। पहले setnames(DT,'.N','N') आज़माएं।

source: The column '.I' can't be grouped because it conflicts with the special .I variable. Try setnames(DT,'.I','I') first.
hi_in: कॉलम (column) '.I' को समूहबद्ध नहीं किया जा सकता क्योंकि यह विशेष .I वैरिएबल (variable) के साथ टकराता है। पहले setnames(DT,'.I','I') आज़माएं।

source: Note: forcing units="secs" on implicit difftime by group; call difftime explicitly to choose custom units
hi_in: नोट: समूह द्वारा अंतर्निहित difftime पर units="secs" को लागू करना; कस्टम (custom) यूनिट्स (unit) चुनने के लिए difftime को स्पष्ट रूप से कॉल (call) करें।

source: logical error. i is not data.table, but mult='all' and 'by'=.EACHI
hi_in: तार्किक त्रुटि। i data.table नहीं है, लेकिन mult='all' और 'by'=.EACHI।

source: Finding groups using forderv ...
hi_in: forderv का उपयोग करके समूह खोज रहा है ...।

source: Finding group sizes from the positions (can be avoided to save RAM) ...
hi_in: स्थितियों से समूह आकार ढूंढना (RAM बचाने के लिए इसे टाला जा सकता है) ...।

source: Getting back original order ...
hi_in: मूल क्रम में वापस आना ...।

source: Finding groups using uniqlist on key ...
hi_in: key पर uniqlist का उपयोग करके समूहों की खोज करना ...।

source: Finding groups using uniqlist on index '%s' ...
hi_in: इंडेक्स (indices) '%s' पर uniqlist का उपयोग करके समूहों की खोज करना ...।

source: lapply optimization changed j from '%s' to '%s'
hi_in: lapply अनुकूलन ने j को '%s' से '%s' में बदल दिया।

source: lapply optimization is on, j unchanged as '%s'
hi_in: lapply अनुकूलन चालू है, j '%s' के रूप में अपरिवर्तित है।

source: GForce optimized j to '%s' (see ?GForce)
hi_in: GForce ने j को '%s' में अनुकूलित किया (देखें ?GForce)।

source: GForce is on, but not activated for this query; left j unchanged (see ?GForce)
hi_in: GForce चालू है, लेकिन इस क्वेरी के लिए सक्रिय नहीं है; j को अपरिवर्तित छोड़ दिया गया (देखें ?GForce)।

source: Unable to optimize call to mean() and could be very slow. You must name 'na.rm' like that otherwise if you do mean(x,TRUE) the TRUE is taken to mean 'trim' which is the 2nd argument of mean. 'trim' is not yet optimized.
hi_in: mean() के कॉल (call) को अनुकूलित करने में असमर्थ और यह बहुत धीमा हो सकता है। आपको 'na.rm' को इस तरह से नाम देना चाहिए अन्यथा यदि आप mean(x,TRUE) करते हैं तो TRUE का अर्थ 'trim' के रूप में लिया जाता है जो mean का दूसरा तर्क है। 'trim' अभी तक अनुकूलित नहीं है।

source: Old mean optimization changed j from '%s' to '%s'
hi_in: पुराने mean अनुकूलन ने j को '%s' से '%s' में बदल दिया।

source: Old mean optimization is on, left j unchanged.
hi_in: पुराना mean अनुकूलन चालू है, j को अपरिवर्तित छोड़ दिया गया है।

source: All optimizations are turned off
hi_in: सभी अनुकूलन बंद कर दिए गए हैं।

source: Optimization is on but left j unchanged (single plain symbol): '%s'
hi_in: अनुकूलन चालू है लेकिन j को अपरिवर्तित छोड़ दिया गया (सिंगल प्लेन प्रतीक): '%s'।

source: Making each group and running j (GForce %s) ...
hi_in: प्रत्येक समूह बना रहा है और j को चला रहा है (GForce %s) ...।

source: setkey() after the := with keyby= ...
hi_in: := के साथ keyby= के बाद setkey() ...।

source: The setkey() normally performed by keyby= has been skipped (as if by= was used) because := is being used together with keyby= but the keyby= contains some expressions. To avoid this warning, use by= instead, or provide existing column names to keyby=.
hi_in: keyby= द्वारा सामान्य रूप से निष्पादित setkey() को छोड़ दिया गया है (मानो by= का उपयोग किया गया हो) क्योंकि := का उपयोग keyby= के साथ किया जा रहा है लेकिन keyby= में कुछ अभिव्यक्तियां हैं। इस चेतावनी से बचने के लिए, इसके बजाय by= का उपयोग करें, या keyby= के लिए मौजूदा कॉलम (column) नाम प्रदान करें।

source: setkey() afterwards for keyby=.EACHI ...
hi_in: keyby=.EACHI के बाद setkey() ...।

source: rownames and rownames.value cannot both be used at the same time
hi_in: rownames और rownames.value को एक ही समय में दोनों का उपयोग नहीं किया जा सकता।

source: length(rownames)==%d but nrow(DT)==%d. The rownames argument specifies a single column name or number. Consider rownames.value= instead.
hi_in: length(rownames)==%d लेकिन nrow(DT)==%d। rownames तर्क एकल कॉलम (column) नाम या संख्या निर्दिष्ट करता है। इसके बजाय rownames.value= पर विचार करें।

source: length(rownames)==0 but should be a single column name or number, or NULL
hi_in: length(rownames)==0 है लेकिन इसे एकल कॉलम (column) नाम या संख्या, या NULL होना चाहिए।

source: rownames is TRUE but key has multiple columns %s; taking first column x[,1] as rownames
hi_in: rownames TRUE है लेकिन key में कई कॉलम (column) %s हैं; पहले कॉलम (column) x[,1] को rownames के रूप में लिया जा रहा है।

source: '%s' is not a column of x
hi_in: %s' x का एक कॉलम (column) नहीं है।

source: as.integer(rownames)==%d which is outside the column number range [1,ncol=%d].
hi_in: as.integer(rownames)==%d जो कॉलम (column) नंबर सीमा [1,ncol=%d] के बाहर है।

source: length(rownames.value)==%d but should be nrow(x)==%d
hi_in: length(rownames.value)==%d है लेकिन इसे nrow(x)==%d होना चाहिए।

source: When i is a matrix in DT[i]<-value syntax, it doesn't make sense to provide j
hi_in: जब i DT[i]<-value सिंटैक्स (syntax) में एक मैट्रिक्स (matrix) होता है, तो j प्रदान करना तर्कसंगत नहीं है।

source: j must be an atomic vector, see ?is.atomic
hi_in: j एक एटॉमिक (atomic) वेक्टर (vector) होना चाहिए, देखें ?is.atomic।

source: NA in j
hi_in: j में NA।

source: j must be vector of column name or positions
hi_in: j को कॉलम (column) नाम या पोजिशन का वेक्टर (vector) होना चाहिए।

source: Attempt to assign to column position greater than ncol(x). Create the column by name, instead. This logic intends to catch (most likely) user errors.
hi_in: ncol(x) से अधिक कॉलम (column) स्थिति को असाइन (assign) करने का प्रयास। इसके बजाय कॉलम (column) को नाम से बनाएं। यह लॉजिक (logical) (संभवतः) उपयोगकर्ता त्रुटियों को पकड़ने के लिए है।

source: data.table inherits from data.frame (from v1.5), but this data.table does not. Has it been created manually (e.g. by using 'structure' rather than 'data.table') or saved to disk using a prior version of data.table?
hi_in: data.table data.frame (v1.5 से) से विरासत में प्राप्त होता है, लेकिन यह data.table नहीं करता। क्या इसे मैन्युअल (manually) रूप से बनाया गया है (जैसे 'structure' का उपयोग करके 'data.table' के बजाय) या data.table के पुराने संस्करण का उपयोग करके डिस्क (disk) में सहेजा गया है?

source: attempting to assign invalid object to dimnames of a data.table
hi_in: data.table के dimnames को अमान्य ऑब्जेक्ट (object) असाइन (assign) करने का प्रयास।

source: data.tables do not have rownames
hi_in: data.tables में rownames नहीं होते।

source: Can't assign %d names to a %d-column data.table
hi_in: %d नामों को %d-कॉलम (column) data.table में असाइन (assign) नहीं कर सकते।

source: 'subset' must evaluate to logical
hi_in: 'subset' को लॉजिकल (logical) के रूप में मूल्यांकित होना चाहिए।

source: Argument 'invert' must be logical TRUE/FALSE
hi_in: तर्क 'invert' को लॉजिकल (logical) TRUE/FALSE होना चाहिए।

source: x argument must be a data.table
hi_in: x तर्क एक data.table होना चाहिए।

source: group length is 0 but data nrow > 0
hi_in: समूह की लेंथ (length) 0 है लेकिन डेटा (data) nrow > 0।

source: passing 'f' argument together with 'by' is not allowed, use 'by' when split by column in data.table and 'f' when split by external factor
hi_in: 'by' के साथ 'f' तर्क को पास करना अनुमति नहीं है, कॉलम (column) द्वारा विभाजन के लिए data.table में 'by' का उपयोग करें और बाहरी कारक द्वारा विभाजन के लिए 'f' का उपयोग करें।

source: Either 'by' or 'f' argument must be supplied
hi_in: या तो 'by' या 'f' तर्क प्रदान किया जाना चाहिए।

source: Column '.ll.tech.split' is reserved for split.data.table processing
hi_in: कॉलम (column) '.ll.tech.split' को split.data.table प्रोसेसिंग (process) के लिए आरक्षित किया गया है।

source: Column '.nm.tech.split' is reserved for split.data.table processing
hi_in: कॉलम (column) '.nm.tech.split' को split.data.table प्रोसेसिंग (process) के लिए आरक्षित किया गया है।

source: Argument 'by' must refer to column names in x
hi_in: तर्क 'by' को x में कॉलम (column) नामों का संदर्भ देना चाहिए।

source: Argument 'by' must refer only to atomic-type columns, but the following columns are non-atomic: %s
hi_in: तर्क 'by' को केवल एटॉमिक (atomic)-प्रकार के कॉलम (column) का संदर्भ देना चाहिए, लेकिन निम्नलिखित कॉलम (column) गैर-एटॉमिक (atomic) हैं: %s।

source: Processing split.data.table with: %s
hi_in: split.data.table को प्रोसेस (process) किया जा रहा है: %s।

source: x is not a data.table|frame. Shallow copy is a copy of the vector of column pointers (only), so is only meaningful for data.table|frame
hi_in: x data.table|फ्रेम नहीं है। शैलो (shallow) कॉपी (copy) कॉलम (column) पॉइंटर्स (pointers) के वेक्टर (vector) की कॉपी (copy) (केवल) है, इसलिए यह केवल data.table|फ्रेम के लिए सार्थक है।

source: setalloccol attempting to modify `*tmp*`
hi_in: setalloccol *tmp* को संशोधित करने का प्रयास कर रहा है।

source: Input is a length=1 logical that points to the same address as R's global value. Therefore the attribute has not been set by reference, rather on a copy. You will need to assign the result back to a variable. See issue #1281.
hi_in: इनपुट एक लेंथ (length)=1 लॉजिकल (logical) है जो R के ग्लोबल (global) मान के समान पते की ओर इशारा करता है। इसलिए विशेषता को संदर्भ द्वारा सेट नहीं किया गया है, बल्कि एक कॉपी (copy) पर किया गया है। आपको परिणाम को एक वैरिएबल (variable) में वापस असाइन (assign) करने की आवश्यकता होगी। समस्या #1281 देखें।

source: x is not a data.table or data.frame
hi_in: x एक data.table या data.frame नहीं है।

source: x has %d columns but its names are length %d
hi_in: x में %d कॉलम (column) हैं लेकिन इसके नाम की लेंथ (length) %d है।

source: Passed a vector of type '%s'. Needs to be type 'character'.
hi_in: प्रकार '%s' का वेक्टर (vector) पास किया गया। इसे प्रकार 'कैरेक्टर (character)' होना चाहिए।

source: 'new' is not a character vector or a function
hi_in: new' एक कैरेक्टर (character) वेक्टर (vector) या फ़ंक्शन (function) नहीं है।

source: NA in 'new' at positions %s
hi_in: new' में %s पर NA।

source: Some duplicates exist in 'old': %s
hi_in: old' में कुछ डुप्लिकेट (duplicate) मौजूद हैं: %s।

source: Argument 'x' to 'setDT' should be a 'list', 'data.frame' or 'data.table'
hi_in: setDT' के तर्क 'x' को 'लिस्ट (list)', 'data.frame' या 'data.table' होना चाहिए।

source: Item '%s' not found in names of input list
hi_in: इनपुट (input) लिस्ट (list) के नामों में आइटम (item) '%s' नहीं मिला।

source: 'prefix' must be NULL or a character vector of length 1.
hi_in: 'prefix' NULL या लेंथ (length) 1 का कैरेक्टर (character) वेक्टर (vector) होना चाहिए।

source: x is a single vector, non-NULL 'cols' doesn't make sense.
hi_in: x एकल वेक्टर (vector) है, गैर-NULL 'cols' का कोई मतलब नहीं है।

source: x is a list, 'cols' cannot be 0-length.
hi_in: x एक लिस्ट (list) है, 'cols' की लेंथ (length) 0 नहीं हो सकती।

source: It looks like you re-used `:=` in argument %d a functional assignment call -- use `=` instead: %s(col1=val1, col2=val2, ...)
hi_in: ऐसा प्रतीत होता है कि आपने तर्क %d में := को पुनः उपयोग किया है, एक फंक्शनल (function) कार्यभार कॉल (call) के रूप में -- इसके बजाय = का उपयोग करें: %s(col1=val1, col2=val2, ...)।

source: RHS of %s is length %d which is not 1 or nrow (%d). For robustness, no recycling is allowed (other than of length 1 RHS). Consider %%in%% instead.
hi_in: %s का RHS लेंथ (length) %d है, जो 1 या nrow (%d) नहीं है। मजबूतता के लिए, पुनरावृत्ति की अनुमति नहीं है (लेंथ (length) 1 RHS को छोड़कर)। इसके बजाय %%in%% पर विचार करें।

source: Subsetting optimization disabled because the cross-product of RHS values exceeds 1e4, causing memory problems.
hi_in: सबसेटिंग (subsetting) अनुकूलन को निष्क्रिय कर दिया गया है क्योंकि RHS मानों का गुणनफल 1e4 से अधिक है, जिससे स्मृति की समस्या उत्पन्न हो रही है।

source: Optimized subsetting with key %s
hi_in: key %s के साथ अनुकूलन सबसेटिंग (subsetting)।

source: Optimized subsetting with index '%s'
hi_in: सूचकांक '%s' के साथ अनुकूलन सबसेटिंग (subsetting)।

source: Creating new index '%s'
hi_in: नया सूचकांक '%s' बनाया जा रहा है।

source: Creating index %s done in ...
hi_in: सूचकांक %s को बनाया गया ...।

source: 'on' argument should be a named atomic vector of column names indicating which columns in 'i' should be joined with which columns in 'x'.
hi_in: 'on' तर्क को कॉलम (column) नामों का नामांकित एटॉमिक (atomic) वेक्टर (vector) होना चाहिए, जो इंगित करता है कि 'i' में कौन से कॉलम (column) 'x' में कौन से कॉलमों (column) के साथ जोड़े जाने चाहिए।

source: Found more than one operator in one 'on' statement: %s. Please specify a single operator.
hi_in: 'on' कथन में एक से अधिक ऑपरेटर (operator) पाए गए: %s। कृपया एक ही ऑपरेटर (operator) निर्दिष्ट करें।

source: 'on' contains no column name: %s. Each 'on' clause must contain one or two column names.
hi_in: 'on' में कोई कॉलम (column) नाम नहीं है: %s। प्रत्येक 'on' खंड में एक या दो कॉलम (column) नाम होने चाहिए।

source: 'on' contains more than 2 column names: %s. Each 'on' clause must contain one or two column names.
hi_in: 'on' में 2 से अधिक कॉलम (column) नाम हैं: %s। प्रत्येक 'on' खंड में एक या दो कॉलम (column) नाम होने चाहिए।

source: Invalid join operators %s. Only allowed operators are %s.
hi_in: अमान्य जॉइन (join) ऑपरेटर (operator) %s। केवल अनुमत ऑपरेटर (operator) हैं %s।

source: column not removed because not found: %s
hi_in: कॉलम (column) को नहीं हटाया गया क्योंकि नहीं मिला: %s।

source: column not found: %s
hi_in: कॉलम (column) नहीं मिला: %s।

source: The item in the 'by' or 'keyby' list is length %s.
hi_in: by' या 'keyby' लिस्ट (list) में आइटम (item) की लेंथ (length) %s है।

source: as.data.table.array method should only be called for arrays with 3+ dimensions; use the matrix method for 2-dimensional arrays
hi_in: as.data.table.array विधि केवल 3+ आयामों वाले एरे (array) के लिए ही कॉल (call) की जानी चाहिए; 2-आयामी एरे (array) के लिए मैट्रिक्स (matrix) विधि का उपयोग करें

source: Argument 'value.name' must be scalar character, non-NA and at least one character
hi_in: तर्क 'value.name' स्केलर (scalar) कैरेक्टर (character), non-NA और कम से कम एक कैरेक्टर (character) का होना चाहिए

source: Argument 'sorted' must be scalar logical and non-NA
hi_in: आर्गुमेंट (argument) 'sorted' स्केलर (scalar) लॉजिकल (logical) और non-NA होना चाहिए

source: Argument 'na.rm' must be scalar logical and non-NA
hi_in: आर्गुमेंट (argument) 'na.rm' स्केलर (scalar) लॉजिकल (logical) और non-NA होना चाहिए

source: Please provide either 'key' or 'sorted', but not both.
hi_in: कृपया 'key' या 'sorted' में से एक प्रदान करें, लेकिन दोनों नहीं।

source: Argument 'value.name' should not overlap with column names in result: %s
hi_in: तर्क 'value.name' परिणाम में कॉलम (column) नाम के साथ परस्पर नहीं होना चाहिए: %s

source: POSIXlt column type detected and converted to POSIXct. We do not recommend use of POSIXlt at all because it uses 40 bytes to store one date.
hi_in: POSIXlt कॉलम (column) प्रकार का पता चला और इसे POSIXct में परिवर्तित किया गया।हम POSIXlt के उपयोग की सिफारिश बिल्कुल नहीं करते हैं क्योंकि यह एक तिथि को संग्रहीत करने के लिए 40 बाइट्स (bytes) का उपयोग करता है।

source: Item %d has %d rows but longest item has %d; recycled with remainder.
hi_in: आइटम (item) %d में %d रोज़ (rows) हैं लेकिन सबसे लंबे आइटम (item) में %d है; शेष के साथ पुनः चक्रित किया गया।

source: A column may not be called .SD. That has special meaning.
hi_in: कोई कॉलम (column) .SD नामित नहीं किया जा सकता। इसका विशेष अर्थ है।

source: class must be length 1
hi_in: क्लास (class) की लेन्थ (length) 1 होनी चाहिए
