Repository: Rdatatable/data.table
Catalog: hindi_files/R-fcast-*.po
Languages: hi_in

source: Using '%s' as value column. Use 'value.var' to override
hi_in: %s' को मान कॉलम (column) के रूप में उपयोग किया जा रहा है। ओवरराइड (override) करने के लिए 'value.var' का उपयोग करें

source: The %1$s generic in data.table has been passed a %2$s, but data.table::%1$s currently only has a method for data.tables. Please confirm your input is a data.table, with setDT(%3$s) or as.data.table(%3$s). If you intend to use a method from reshape2, try installing that package first, but do note that reshape2 is superseded and is no longer actively developed.
hi_in: data.table में %1$s generic को %2$s पास (pass) किया गया है, लेकिन data.table::%1$s मैं अभी केवल data.tables के लिए एक विधि है। कृपया सुनिश्चित करें कि आपका इनपुट (input)data.table है, setDT(%3$s) या as.data.table(%3$s) से। यदि आप reshape2 से कोई विधि (method) उपयोग करना चाहते हैं, तो पहले उस पैकेज (package) को इंस्टॉल (install) करें, लेकिन ध्यान दें कि reshape2 अब सुपरसिडेड (superseded) है और सक्रिय रूप से डेवलप (develop) नहीं किया जा रहा है।

source: The %1$s generic in data.table has been passed a %2$s and will attempt to redirect to the relevant reshape2 method; please note that reshape2 is superseded and is no longer actively developed, and this redirection is now deprecated. Please do this redirection yourself like reshape2::%1$s(%3$s). In the next version, this warning will become an error.
hi_in: data.table में %1$s generic को %2$s पास (pass) किया गया है और इसे संबंधित reshape2 विधि (method) पर रीडायरेक्ट (redirect) करने का प्रयास किया जाएगा; कृपया ध्यान दें कि reshape2 अब सुपरसिडेड (superseded) है और सक्रिय रूप से डेवलप (develop) नहीं किया जा रहा है, और यह रीडायरेक्शन (redirection) अब डिप्रिकेटेड (deprecated) है। कृपया इस रीडायरेक्शन (redirection) को स्वयं इस तरह करें: reshape2::%1$s(%3$s)। अगली वर्ज़न (version) में, यह वॉर्निंग (warning) एरर (error) में बदल जाएगी।

source: Invalid formula. Cast formula should be of the form LHS ~ RHS, for e.g., a + b ~ c.
hi_in: अमान्य सूत्र। कास्ट (cast) सूत्र LHS ~ RHS के रूप में होना चाहिए, जैसे, a + b ~ c।

source: data.table to cast must have unique column names
hi_in: कास्ट (cast) किए जाने वाले data.table में अद्वितीय कॉलम (column) नाम होने चाहिए

source: value.var values %s are not found in 'data'.
hi_in: 'data' में value.var मान %s नहीं मिले।

source: When 'fun.aggregate' and 'value.var' are both lists, 'value.var' must be either of length =1 or =length(fun.aggregate).
hi_in: जब 'fun.aggregate' और 'value.var' दोनों लिस्ट्स (lists) हो, तो 'value.var' की लेंथ (length) 1 या =length(fun.aggregate) होनी चाहिए।

source: 'data' must be a data.table.
hi_in: 'data' में value.var मान %s नहीं मिले।

source: 'drop' must be logical TRUE/FALSE
hi_in: 'drop' लॉजिकल (logical) TRUE/FALSE होना चाहिए

source: Argument 'value.var.in.dots' should be logical TRUE/FALSE
hi_in: आर्ग्युमेंट (argument) 'value.var.in.dots' लॉजिकल (logical) TRUE/FALSE होना चाहिए

source: Arguments 'value.var.in.LHSdots', 'value.var.in.RHSdots' should be logical TRUE/FALSE
hi_in: आर्गुमेंट्स (arguments) 'value.var.in.LHSdots', 'value.var.in.RHSdots' लॉजिकल (logical) TRUE/FALSE होने चाहिए

source: Column [%s] not found or of unknown type.
hi_in: कॉलम (column) [%s] नहीं मिला या अज्ञात type का है

source: Columns specified in formula can not be of type list
hi_in: सूत्र में निर्दिष्ट कॉलम (column) लिस्ट (list) प्रकार के नहीं हो सकते

source: 'fun.aggregate' is NULL, but found duplicate row/column combinations, so defaulting to length(). That is, the variables %s used in 'formula' do not uniquely identify rows in the input 'data'. In such cases, 'fun.aggregate' is used to derive a single representative value for each combination in the output data.table, for example by summing or averaging (fun.aggregate=sum or fun.aggregate=mean, respectively). Check the resulting table for values larger than 1 to see which combinations were not unique. See ?dcast.data.table for more details.
hi_in: 'fun.aggregate' NULL है, लेकिन डुप्लिकेट (duplicate) रो(row)/कॉलम(column) संयोजन मिले, इसलिए 'data' में रोज़(rows) को अद्वितीय रूप से पहचान नहीं सकते। ऐसे मामलों में, 'fun.aggregate' का उपयोग आउटपुट (output) data.table में प्रत्येक संयोजन के लिए सिंगल (single) प्रतिनिधि मान प्राप्त करने के लिए किया जाता है, उदाहरण के लिए summing या averaging (fun.aggregate=sum या fun.aggregate=mean, क्रमशः)।

source: Aggregating functions should take a vector as input and return a single value (length=1), but they do not, so the result is undefined. Please fix by modifying your function so that a single value is always returned.
hi_in: कृपया अपने फ़ंक्शन (function) को संशोधित करें ताकि हमेशा सिंगल (single) मान लौटाया जा सके।
