Repository: Rdatatable/data.table
Catalog: hindi_files/R-fread-*.po
Languages: hi_in

source: Used more than one of the arguments input=, file=, text= and cmd=.
hi_in: input=, file=, text= और cmd= में से एक से अधिक आर्ग्युमेंट (argument) का उपयोग किया गया है।

source: Argument 'encoding' must be 'unknown', 'UTF-8' or 'Latin-1'.
hi_in: आर्ग्युमेंट (argument) 'encoding' 'unknown', 'UTF-8' या 'Latin-1' होना चाहिए।

source: 'text=' is type %s but must be character.
hi_in: 'text=' का प्रकार %s है लेकिन इसे कैरेक्टर (character) होना चाहिए।

source: input= must be a single character string containing a file name, a system command containing at least one space, a URL starting 'http[s]://', 'ftp[s]://' or 'file://', or, the input data itself containing at least one \n or \r
hi_in: input= एक सिंगल (single) कैरेक्टर (character) स्ट्रिंग (string) होनी चाहिए जिसमें एक फाइल (file) का नाम, कम से कम एक स्पेस (space) वाली सिस्टम (system) कमांड (command), 'http[s]://', 'ftp[s]://' या 'file://' से शुरू होने वाला URL, या स्वयं इनपुट (input) डेटा (data) हो जिसमें कम से कम एक या हो

source: input= contains no \n or \r, but starts with a space. Please remove the leading space, or use text=, file= or cmd=
hi_in: input= में कोई या नहीं है, लेकिन यह स्पेस (space) से शुरू होता है। कृपया प्रारंभिक स्पेस (space) को हटाएं, या text=, file= या cmd= का उपयोग करें

source: Taking input= as a system command because it contains a space ('%s'). If it's a filename please remove the space, or use file= explicitly. A variable is being passed to input= and when this is taken as a system command there is a security concern if you are creating an app, the app could have a malicious user, and the app is not running in a secure environment; e.g. the app is running as root. Please read item 5 in the NEWS file for v1.11.6 for more information and for the option to suppress this message.
hi_in: input= को एक सिस्टम (system) कमांड (command) के रूप में लिया जा रहा है क्योंकि इसमें एक स्पेस (space) ('%s') है। अगर यह एक फाइल (file) का नाम है, तो कृपया स्पेस (space) को हटा दें, या file= को स्पष्ट रूप से उपयोग करें। जब एक वैरिएबल (variable) input= में पास किया जाता है और इसे सिस्टम (system) कमांड (command) के रूप में लिया जाता है, तो यदि आप एक ऐप बना रहे हैं तो सुरक्षा का मुद्दा हो सकता है, ऐप में एक दुर्भावनापूर्ण उपयोगकर्ता हो सकता है, और ऐप सुरक्षित वातावरण में नहीं चल रहा है; उदाहरण के लिए, ऐप रूट के रूप में चल रहा है। अधिक जानकारी के लिए कृपया v1.11.6 के NEWS फ़ाइल (file) में आइटम (item) 5 पढ़ें और इस संदेश को दबाने के विकल्प के लिए।

source: file= must be a single character string containing a filename, or URL starting 'http[s]://', 'ftp[s]://' or 'file://'
hi_in: file= एक सिंगल (single) कैरेक्टर (character) स्ट्रिंग (string) होनी चाहिए जिसमें एक फाइल (file) का नाम, या 'http[s]://', 'ftp[s]://' या 'file://' से शुरू होने वाला URL हो

source: File '%s' does not exist or is non-readable. getwd()=='%s'
hi_in: फाइल (file) '%s' मौजूद नहीं है या पढ़ने योग्य नहीं है। getwd()=='%s'

source: File '%s' is a directory. Not yet implemented.
hi_in: फाइल (file) '%s' एक डायरेक्टरी (directory) है। अभी तक लागू नहीं किया गया है।

source: File '%s' has size 0. Returning a NULL %s.
hi_in: फाइल (file) '%s' का आकार 0 है। NULL %s लौटाई जा रही है।

source: Compressed files containing more than 1 file are currently not supported.
hi_in: एक से अधिक फाइलें (file) वाली कंप्रेस्ड (compressed) फाइलें (file) वर्तमान में समर्थित नहीं हैं।

source: To read %s files directly, fread() requires 'R.utils' package which cannot be found. Please install 'R.utils' using 'install.packages('R.utils')'.
hi_in: %s फाइलों (file) को सीधे पढ़ने के लिए, fread() को 'R.utils' पैकेज (package) की आवश्यकता होती है जो उपलब्ध नहीं है। कृपया 'install.packages('R.utils')' का उपयोग करके इसे इंस्टॉल (install) करें।

source: 'autostart' is now deprecated and ignored. Consider skip='string' or skip=n
hi_in: 'autostart' अब अप्रचलित (deprecated) है और इसे अनदेखा किया जा रहा है। कृपया skip='string' या skip=n का उपयोग करने पर विचार करें

source: colClasses is type 'logical' which is ok if all NA but it has some TRUE or FALSE values in it which is not allowed. Please consider the drop= or select= argument instead. See ?fread.
hi_in: colClasses का प्रकार 'logical' है, जो सभी NA के लिए ठीक है लेकिन इसमें कुछ TRUE या FALSE मान हैं, जो स्वीकार्य नहीं हैं। कृपया इसके बजाय drop= या select= आर्ग्युमेंट (argument) का उपयोग करने पर विचार करें। ?fread देखें।

source: colClasses is not type list or character vector
hi_in: colClasses का प्रकार लिस्ट (list) या कैरेक्टर (character) वेक्टर (vector) नहीं है

source: colClasses="NULL" (quoted) is interpreted as colClasses=NULL (the default) as opposed to dropping every column.
hi_in: colClasses="NULL" (उद्धृत) को colClasses=NULL (डिफ़ॉल्ट) के रूप में लिया जाता है, हर कॉलम को हटाने के विपरीत

source: na.strings[%d]=="%s" consists only of whitespace, ignoring
hi_in: na.strings[%d]=="%s" केवल स्पेस (space) से बना है, इसे अनदेखा किया जा रहा है

source: %s. Since strip.white=TRUE (default), use na.strings="" to specify that any number of spaces in a string column should be read as <NA>.
hi_in: %s. चूंकि strip.white=TRUE (डिफ़ॉल्ट (default)) है, na.strings="" का उपयोग करें ताकि स्ट्रिंग (string) कॉलम (column) में किसी भी संख्या में स्पेस (space) को <NA> के रूप में पढ़ा जाए।

source: %s. strip.white==TRUE (default) and "" is present in na.strings, so any number of spaces in string columns will already be read as <NA>.
hi_in: %s. strip.white==TRUE (डिफ़ॉल्ट (default)) है और na.strings में "" मौजूद है, इसलिए स्ट्रिंग (string) कॉलम (column) में किसी भी संख्या में स्पेस (space) को पहले से ही <NA> के रूप में पढ़ा जाएगा।

source: %s. But strip.white=FALSE. Use strip.white=TRUE (default) together with na.strings="" to turn any number of spaces in string columns into <NA>
hi_in: %s. लेकिन strip.white=FALSE है। strip.white=TRUE (डिफ़ॉल्ट (default)) का उपयोग na.strings="" के साथ करें ताकि स्ट्रिंग (string) कॉलम (column) में किसी भी संख्या में स्पेस (space) को <NA> में परिवर्तित किया जा सके।

source: 'data.table' relies on the package 'yaml' to parse the file header; please add this to your library with install.packages('yaml') and try again.
hi_in: 'data.table' फाइल (file) हेडर (header) को पार्स (parse) करने के लिए 'yaml' पैकेज (package)पर निर्भर करता है; कृपया इसे अपनी लाइब्रेरी (library) में install.packages('yaml') का उपयोग करके जोड़ें और फिर से प्रयास करें।

source: Combining a search string as 'skip' and reading a YAML header may not work as expected -- currently, reading will proceed to search for 'skip' from the beginning of the file, NOT from the end of the metadata; please file an issue on GitHub if you'd like to see more intuitive behavior supported.
hi_in: एक खोज स्ट्रिंग (string) को 'skip' के रूप में जोड़ना और YAML हेडर (header) पढ़ना अपेक्षित रूप से काम नहीं कर सकता -- वर्तमान में, पढ़ाई फाइल (file) की शुरुआत से 'skip' के लिए खोज करने के लिए आगे बढ़ेगी, मेटाडेटा (metadata) के अंत से नहीं; यदि आप अधिक सहज व्यवहार देखना चाहते हैं तो कृपया GitHub पर एक इशू दर्ज करें।

source: Encountered <%s%s> at the first unskipped line (%d), which does not constitute the start to a valid YAML header (expecting something matching regex "%s"); please check your input and try again.
hi_in: पहले अनस्किप्ड पंक्ति (%d) पर <%s%s> का सामना किया, जो एक मान्य YAML हेडर (header) की शुरुआत का गठन नहीं करता (regex "%s" से मेल खाने की उम्मीद); कृपया अपनी इनपुट (input) जांचें और फिर से प्रयास करें।

source: Reached the end of the file before finding a completion to the YAML header. A valid YAML header is bookended by lines matching the regex "%s". Please double check the input file is a valid csvy.
hi_in: YAML हेडर (header) को पूर्ण करने से पहले फाइल (file) का अंत आ गया। एक मान्य YAML हेडर (header) regex "%s" से मेल खाने वाली पंक्तियों से बुकेंड (bookended) किया गया है। कृपया सुनिश्चित करें कि इनपुट (input) फाइल (file) एक वैध csvy है।

source: Processed %d lines of YAML metadata with the following top-level fields: %s
hi_in: निम्नलिखित उच्च-स्तरीय फ़ील्ड (field) के साथ YAML मेटाडेटा (metadata) की %d पंक्तियां प्रोसेस की गईं: %s

source: User-supplied 'header' will override that found in metadata.
hi_in: यूजर द्वारा दी गई 'header' मेटाडेटा (metadata) में पाई गई को ओवरराइड (override) करेगी।

source: User-supplied column names in 'col.names' will override those found in YAML metadata.
hi_in: 'col.names' में यूजर द्वारा दी गई कॉलम (column) के नाम YAML मेटाडेटा (metadata) में पाए गए को ओवरराइड (override) करेंगे।

source: colClasses dictated by user input and those read from YAML header are in conflict (specifically, for column(s) [%s]); the proceeding assumes the user input was an intentional override and will ignore the type(s) implied by the YAML header; please exclude the column(s) from colClasses if this was unintentional.
hi_in: यूजर इनपुट (input) द्वारा दिए गए colClasses और YAML हेडर (header) से पढ़े गए के बीच विरोध है (विशेष रूप से, कॉलम (column) [%s] के लिए); आगे की प्रक्रिया यह मानती है कि यूजर इनपुट (input) एक जानबूझकर ओवरराइड (override) था और YAML हेडर (header) द्वारा निहित प्रकारों को अनदेखा करेगी; यदि यह अनजाने में था तो कृपया कॉलम (column) को colClasses से हटा दें।

source: User-supplied 'sep' will override that found in metadata.
hi_in: यूजर द्वारा दी गई 'sep' मेटाडेटा (metadata) में पाई गई को ओवरराइड (override) करेगी।

source: User-supplied 'quote' will override that found in metadata.
hi_in: यूजर द्वारा दी गई 'quote' मेटाडेटा (metadata) में पाई गई को ओवरराइड (override) करेगी।

source: User-supplied 'dec' will override that found in metadata.
hi_in: यूजर द्वारा दिया गया 'dec' मेटाडेटा (metadata) में पाई गई को ओवरराइड (override) करेगा।

source: User-supplied 'na.strings' will override that found in metadata.
hi_in: यूजर द्वारा दी गई 'na.strings' मेटाडेटा (metadata) में पाई गई को ओवरराइड (override) करेगी।

source: Column '%s' was requested to be '%s' but fread encountered the following warning: %s so the column has been left as type '%s'
hi_in: कॉलम (column) '%s' को '%s' अनुरोधित किया गया था लेकिन fread ने निम्नलिखित चेतावनी का सामना किया: %s इसलिए कॉलम (column) को '%s' प्रकार के रूप में छोड़ दिया गया है

source: Column '%s' was requested to be '%s' but fread encountered the following error: %s so the column has been left as type '%s'
hi_in: कॉलम (column) '%s' को '%s' अनुरोधित किया गया था लेकिन fread ने निम्नलिखित एरर (error) का सामना किया: %s इसलिए कॉलम (column) को '%s' प्रकार के रूप में छोड़ दिया गया है

source: key argument of data.table() must be a character vector naming columns (NB: col.names are applied before this)
hi_in: data.table() का key आर्ग्युमेंट (argument) कॉलम (column) के नामकरण के लिए एक कैरेक्टर (character) वेक्टर (vector) होना चाहिए (ध्यान दें: col.names इसके पहले लागू होते हैं)

source: index argument of data.table() must be a character vector naming columns (NB: col.names are applied before this)
hi_in: data.table() का index आर्ग्युमेंट (argument) कॉलम (column) के नामकरण के लिए एक कैरेक्टर (character) वेक्टर (vector) होना चाहिए (ध्यान दें: col.names इसके पहले लागू होते हैं)

source: stringsAsFactors=%s converted %d column: %s
hi_in: stringsAsFactors=%s ने %d कॉलम (column) को परिवर्तित किया: %s
