Repository: Rdatatable/data.table
Catalog: hindi_files/R-merge-*.po
Languages: hi_in

source: Argument 'sort' should be logical TRUE/FALSE
hi_in: आर्गुमेंट (argument) 'sort' लॉजिकल (logical) TRUE/FALSE होना चाहिए

source: Argument 'no.dups' should be logical TRUE/FALSE
hi_in: आर्गुमेंट (argument) 'no.dups' लॉजिकल (logical) TRUE/FALSE होना चाहिए

source: Neither of the input data.tables to join have columns.
hi_in: कोई भी इनपुट (input) data.tables, जिन्हें जोड़ा जाना है, में कॉलम (column) नहीं हैं।

source: Input data.table '%s' has no columns.
hi_in: इनपुट (input) data.table '%s' में कोई कॉलम (column) नहीं हैं।

source: `by.x` and `by.y` must be of same length.
hi_in: `by.x` और `by.y` की लेंथ (length) समान होनी चाहिए|

source: Supplied both `by` and `by.x/by.y`. `by` argument will be ignored.
hi_in: दोनों `by` और `by.x/by.y` प्रदान किए गए। `by` आर्गुमेंट (argument) की अनदेखी की जाएगी।

source: A non-empty vector of column names is required for `by.x` and `by.y`.
hi_in: `by.x` और `by.y` के लिए एक गैर-खाली कॉलम (column) नाम का वेक्टर (vector) आवश्यक है।

source: Elements listed in `by.x` must be valid column names in x.
hi_in: `by.x` में सूचीबद्ध तत्वों को x में मान्य कॉलम (column) नाम होना चाहिए।

source: Elements listed in `by.y` must be valid column names in y.
hi_in: `by.y` में सूचीबद्ध तत्वों को y में मान्य कॉलम (column) नाम होना चाहिए।

source: A non-empty vector of column names for `by` is required.
hi_in: `by` के लिए एक गैर-खाली कॉलम (column) नाम का वेक्टर (vector) आवश्यक है।

source: Elements listed in `by` must be valid column names in x and y
hi_in: `by` में सूचीबद्ध तत्वों को x और y में मान्य कॉलम (column) नाम होना चाहिए

source: Unknown argument '%s' has been passed.
hi_in: अज्ञात आर्गुमेंट (argument) '%s' को पारित किया गया है।

source: Passed %d unknown and unnamed arguments.
hi_in: %d अज्ञात और अनाम आर्गुमेंट्स (arguments) पारित किए गए हैं।

source: column names %s are duplicated in the result
hi_in: कॉलम (column) नाम %s परिणाम में दोहराए गए हैं
