Repository: Rdatatable/data.table
Catalog: hindi_files/R-setkey-*.po
Languages: hi_in

source: x may no longer be the character name of the data.table. The possibility was undocumented and has been removed.
hi_in: x अब data.table का कैरेक्टर (character) नाम नहीं हो सकता है।यह संभावना अप्रलेखित थी और हटा दी गई है।

source: key(x)<-value is deprecated and not supported. Please change to use setkey() with perhaps copy(). Has been warning since 2012.
hi_in: key(x)<-value को हटाया जा चुका है और इसका समर्थन नहीं किया जाता है। कृपया setkey() का उपयोग करें, संभवतः copy() के साथ।२०१२ से चेतावनी दी जा रही है।

source: x is not a data.table
hi_in: x एक data.table नहीं है

source: cols is not a character vector. Please see further information in ?setkey.
hi_in: cols एक कैरेक्टर (character) वेक्टर (vector) नहीं है। कृपया ?setkey में आगे की जानकारी देखें।

source: Setting a physical key on .SD is reserved for possible future use; to modify the original data's order by group. Try setindex() instead. Or, set*(copy(.SD)) as a (slow) last resort.
hi_in: .SD पर एक भौतिक कुंजी सेट (set) करना भविष्य के संभावित उपयोग के लिए आरक्षित है; समूह के अनुसार मूल डेटा (data) के क्रम को परिवर्तित करने के लिए।इसके बजाय setindex() का उपयोग करें।या, set*(copy(.SD)) को एक (धीमे) अंतिम उपाय के रूप में उपयोग करें।

source: cols is a character vector of zero length. Removed the key, but use NULL instead, or wrap with suppressWarnings() to avoid this warning.
hi_in: cols एक शून्य लेंथ (length) का कैरेक्टर (character) वेक्टर (vector) है।कुंजी हटा दी गई, लेकिन इसके बजाय NULL का उपयोग करें, या इस चेतावनी से बचने के लिए suppressWarnings() के साथ रैप (wrap) करें।

source: cols is the empty string. Use NULL to remove the key.
hi_in: cols खाली स्ट्रिंग (string) है। कुंजी हटाने के लिए NULL का उपयोग करें।

source: cols contains some blanks.
hi_in: cols में कुछ रिक्त स्थान हैं।

source: some columns are not in the data.table: %s
hi_in: कुछ कॉलम (column) data.table में नहीं हैं: %s

source: x contains a column called '.xi'. Conflicts with internal use by data.table.
hi_in: x में '.xi' नामक एक कॉलम (column) है। यह data.table के आंतरिक उपयोग से टकराव करता है।

source: Column '%s' is type '%s' which is not supported as a key column type, currently.
hi_in: कॉलम (column) '%s' का प्रकार '%s' है जो वर्तमान में मुख्य कॉलम (column) प्रकार के रूप में समर्थित नहीं है।

source: forder took %.03f sec
hi_in: forder ने %.03f सेकंड लिया

source: reorder took %s
hi_in: reorder ने %s लिया

source: x is already ordered by these columns, no need to call reorder
hi_in: x पहले से इन कॉलम्स (columns) द्वारा क्रमबद्ध है, reorder कॉल (call) करने की आवश्यकता नहीं है

source: x is vector but 'by' is supplied
hi_in: x एक वेक्टर (vector) है लेकिन 'by' प्रदान किया गया है

source: x is a single vector, non-NULL 'by' doesn't make sense
hi_in: x एक एकल वेक्टर (vector) है, non-NULL 'by' का कोई मतलब नहीं है

source: Attempting to order a 0-column data.table or data.frame.
hi_in: 0-कॉलम (column) data.table या data.frame को क्रमबद्ध करने का प्रयास किया जा रहा है।

source: The first item passed to [f]order is a plain list but there are more items. It should be a data.table or data.frame.
hi_in: पहला आइटम (item) जो [f]order को पास किया गया है वह एक साधारण list है लेकिन और भी आइटम्स (items) हैं।यह एक data.table या data.frame होना चाहिए।

source: Internal code should not be being called on type double
hi_in: आंतरिक कोड (code) को प्रकार डबल (double) पर नहीं चलाना चाहिए।

source: Input is not a vector of type double. New parallel sort has only been done for double vectors so far. Using one thread.
hi_in: इनपुट (input) डबल (double) प्रकार का वेक्टर (vector) नहीं है। अब तक नए समानांतर सॉर्ट (sort) केवल डबल (double) वेक्टर (vector) के लिए किया गया है।एक थ्रेड (thread) का उपयोग किया जा रहा है।

source: New parallel sort has not been implemented for decreasing=TRUE so far. Using one thread.
hi_in: अब तक decreasing=TRUE के लिए नया समानांतर सॉर्ट (sort) लागू नहीं किया गया है।एक थ्रेड (thread) का उपयोग किया जा रहा है।

source: New parallel sort has not been implemented for vectors containing NA values so far. Using one thread.
hi_in: नए समानांतर क्रम (sort) को अब तक NA मान वाले वेक्टर (vector) के लिए लागू नहीं किया गया है।एक थ्रेड (thread) का उपयोग किया जा रहा है।

source: x must be a data.frame or data.table
hi_in: x एक data.table या data.frame होना चाहिए

source: na.last must be logical TRUE/FALSE
hi_in: na.last को लॉजिकल (logical) TRUE/FALSE होना चाहिए

source: cols is not a character vector. Please see further information in ?setorder.
hi_in: cols एक कैरेक्टर (character) वेक्टर (vector) नहीं है। कृपया अधिक जानकारी के लिए ?setorder देखें।

source: cols is a character vector of zero length. Use NULL instead, or wrap with suppressWarnings() to avoid this warning.
hi_in: cols एक शून्य लेंथ (length) का कैरेक्टर (character) वेक्टर (vector) है।इसके बजाय NULL का उपयोग करें, या इस चेतावनी से बचने के लिए suppressWarnings() के साथ रैप (wrap) करें।

source: Column '%s' is type '%s' which is not supported for ordering currently.
hi_in: कॉलम (column) '%s' का प्रकार '%s' है, जो वर्तमान में क्रमबद्ध करने के लिए समर्थित नहीं है।

source: 'sorted' is TRUE but element %d is non-atomic, which can't be sorted; try setting sorted = FALSE
hi_in: 'sorted' TRUE है लेकिन तत्व %d non-atomic है, जिसे सॉर्ट (sort) नहीं किया जा सकता है।sorted = FALSE सेट (set) करने का प्रयास करें

source: Cross product of elements provided to CJ() would result in %.0f rows which exceeds .Machine$integer.max == %d
hi_in: CJ() को प्रदान किए गए तत्वों का क्रॉस (cross) प्रोडक्ट (product) %.0f रोज़ (rows) में परिणामित होगा, जो .Machine$integer.max == %d से अधिक है
