Repository: Rdatatable/data.table
Catalog: hindi_files/R-test.data.table-*.po
Languages: hi_in

source: data.table package is loaded. Unload or start a fresh R session.
hi_in: data.table पैकेज (package) लोडेड (loaded) है। इसे अनलोड (unload) करें या एक नई R सेशन (session) शुरू करें।

source: script must end with '.Rraw'. If a file ending '.Rraw.bz2' exists, that will be found and used.
hi_in: स्क्रिप्ट (script) को '.Rraw' पर समाप्त होना चाहिए। यदि '.Rraw.bz2' से समाप्त होने वाली फ़ाइल मौजूद है,वह पाई जाएगी और उपयोग की जाएगी।

source: Neither %s nor %s exist in %s
hi_in: न तो %s और न ही %s %s में मौजूद है

source: test.data.table() running: %s
hi_in: test.data.table() चल रहा है: %s

source: object '%s' not found
hi_in: ऑब्जेक्ट (object) '%s' नहीं मिला

source: **** This R session's language is not English. Each test will still check that the correct number of errors and/or **** warnings are produced. However, to test the text of each error/warning too, please restart R with LANGUAGE=en
hi_in: **** इस R सेशन (session) की भाषा अंग्रेज़ी नहीं है। प्रत्येक परीक्षण अभी भी यह जाँच करेगाकि त्रुटियों और/या **** चेतावनियों की सही संख्या उत्पन्न होती है। हालाँकि, प्रत्येक त्रुटि/चेतावनी के पाठ का परीक्षण करने के लिएकृपया LANGUAGE=en के साथ R को पुनः प्रारंभ करें।

source: *** *** memtest=%d. This should be the first call in a fresh R_GC_MEM_GROW=0 R session for best results. Ctrl-C now if not. ***
hi_in: *** memtest=%d. सर्वश्रेष्ठ परिणामों के लिए यह एक नई R_GC_MEM_GROW=0 R सेशन (session) में पहली कॉल होनी चाहिए।यदि ऐसा नहीं है, तो अभी Ctrl-C दबाएँ। ***

source: memtest intended for Linux. Step through data.table:::rss() to see what went wrong.
hi_in: memtest केवल Linux के लिए है। क्या गलत हुआ यह देखने के लिए data.table:::rss() के माध्यम से जाँच करें।

source: Attempt to subset to %d tests matching '%s' failed, running full suite.
hi_in: %d परीक्षणों को '%s' से मेल खाते हुए सबसेट (subset) करने का प्रयास विफल रहा, पूरी श्रृंखला चलाई जा रही है।

source: Running %d of %d tests matching '%s'
hi_in: '%s' से मेल खाते हुए %d में से %d परीक्षण चलाए जा रहे हैं

source: Failed in %s after test %s before the next test() call in %s
hi_in: %s में, अगले test() कॉल (call) से पहले %s परीक्षण के बाद %s में विफल

source: Timings count mismatch: %d vs %d
hi_in: समय की गणना में असमानता: %d बनाम %d

source: 10 longest running tests took %ds (%d%% of %ds)
hi_in: 10 सबसे लंबे चलने वाले परीक्षणों में %ds समाय लगा (%ds का %d%%)

source: 10 largest RAM increases (MB); see plot for cumulative effect (if any)
hi_in: 10 सबसे बड़े RAM वृद्धि (MB); संचयी प्रभाव (अगर कोई हो) के लिए प्लॉट (plot) देखें

source: All %d tests (last %.8g) in %s completed ok in %s
hi_in: सभी %d परीक्षण (आखिरी %.8g) %s में ठीक से पूरे हुए %s

source: Test %s is invalid: when error= is provided it does not make sense to pass y as well
hi_in: परिक्षण %s अमान्य है: जब error= दिया गया है, तो y को भी पास (pass) करना समझ में नहीं आता है

source: Test id %s is not in increasing order
hi_in: परीक्षण संख्या %s बढ़ती क्रम में नहीं है

source: Test %s produced %d %ss but expected %d %s %s
hi_in: परीक्षण %s ने %d %ss उत्पन्न किए लेकिन अपेक्षित %d थे%s %s

source: Test %s didn't produce the correct %s: Expected: %s Observed: %s
hi_in: परीक्षण %s ने सही %s उत्पन्न नहीं किया: अपेक्षित: %s देखा गया: %s

source: Output captured before unexpected warning/error/message:
hi_in: अप्रत्याशित चेतावनी/त्रुटि/संदेश से पहले अंकित किया गया आउटपुट (output):

source: Test %s did not produce correct output:
hi_in: परीक्षण %s ने सही आउटपुट (output) उत्पन्न नहीं किया:

source: Expected: <<%s>>
hi_in: अपेक्षित: <<%s>>

source: Observed: <<%s>>
hi_in: देखा गया: <<%s>>

source: Expected (raw): <<%s>>
hi_in: अपेक्षित (असंसाधित): <<%s>>

source: Observed (raw): <<%s>>
hi_in: देखा गया (असंसाधित): <<%s>>

source: Test %s produced output but should not have:
hi_in: परीक्षण %s ने आउटपुट (output) उत्पन्न किया लेकिन ऐसा नहीं होना चाहिए था:

source: Expected absent (case insensitive): <<%s>>
hi_in: अनुपस्थित की अपेक्षा (केस (case) निरपेक्ष): <<%s>>

source: Expected absent (raw): <<%s>>
hi_in: अनुपस्थित की अपेक्षा (असंसाधित): <<%s>>

source: Test %s ran without errors but selfrefok(%s) is FALSE
hi_in: परीक्षण %s बिना किसी त्रुटि के चला लेकिन selfrefok(%s) FALSE है

source: Test %s ran without errors but failed check that x equals y:
hi_in: परीक्षण %s बिना किसी त्रुटि के चला लेकिन यह जाँच असफल रही कि x y के बराबर है:

source: First %d of %d (type '%s'):
hi_in: पहले %d में से %d (प्रकार '%s'):

source: %d error out of %d. Search %s for test number %s. Duration: %s.
hi_in: %d त्रुटि %d में से। परीक्षण संख्या %s के लिए %s में खोजें। अवधि: %s।
