Repository: Rdatatable/data.table
Catalog: hindi_files/utils-*.po
Languages: hi_in

source: package '%s' not found
hi_in: पैकेज (package) '%s' नहीं मिला

source: namespace '%s' is not available and has not been loaded
hi_in: namespace '%s' उपलब्ध नहीं है और लोड नहीं किया गया है

source: package '%s' (version '%s' is required) is not available
hi_in: पैकेज (package) '%s' (वर्ज़न (version) '%s' आवश्यक है) उपलब्ध नहीं है

source: package '%s' (version '%s' is required) is available but version '%s' is currently installed
hi_in: पैकेज (package) '%s' (वर्ज़न (version) '%s' आवश्यक है) उपलब्ध है लेकिन वर्तमान में वर्ज़न (version) '%s' इंस्टॉल (installed) किया गया है

source: package '%s' (version >= '%s' is required) is not available
hi_in: पैकेज (package) '%s' (वर्ज़न (version) >= '%s' आवश्यक है) उपलब्ध नहीं है

source: package '%s' (version >= '%s' is required) is available but version '%s' is currently installed
hi_in: पैकेज (package) '%s' (वर्ज़न (version) >= '%s' आवश्यक है) उपलब्ध है लेकिन वर्तमान में वर्ज़न (version) '%s' इंस्टॉल (installed) किया गया है

source: package '%s' (version >= '%s' is required) is already loaded, but version '%s' is currently installed
hi_in: पैकेज (package) '%s' (वर्ज़न (version) >= '%s' आवश्यक है) पहले से लोड किया हुआ है, लेकिन वर्तमान में वर्ज़न (version) '%s' इंस्टॉल (installed) किया गया है

source: package '%s' (version '%s' is required) is already loaded, but version '%s' is currently installed
hi_in: पैकेज (package) '%s' (वर्ज़न (version) '%s' आवश्यक है) पहले से लोड किया हुआ है, लेकिन वर्तमान में वर्ज़न (version) '%s' इंस्टॉल (installed) किया गया है

source: package '%s' is already loaded, use that instead
hi_in: पैकेज (package) '%s' पहले से लोड किया हुआ है, इसके बजाय उसका उपयोग करें

source: package '%s' (version >= '%s' is needed) is available, loading it now ...
hi_in: पैकेज (package) '%s' (वर्ज़न (version) >= '%s' आवश्यक है) उपलब्ध है, इसे अब लोड (load) किया जा रहा है ...

source: package '%s' is available, loading it now ...
hi_in: पैकेज (package) '%s' उपलब्ध है, इसे अब लोड (loading) किया जा रहा है ...

source: package '%s' (version >= '%s' is needed) failed to load. Please install package '%s' (version >= '%s').
hi_in: पैकेज (package) '%s' (वर्ज़न (version) >= '%s' आवश्यक है) लोड होने में विफल रहा। कृपया पैकेज (package) '%s' (वर्ज़न (version) >= '%s') इंस्टॉल (installed) करें।

source: package '%s' failed to load. Please install it.
hi_in: पैकेज (package) '%s' लोड (load) होने में विफल रहा। कृपया इसे इंस्टॉल (install) करें।

source: package '%s' (version >= '%s' is suggested) is not available
hi_in: पैकेज (package) '%s' (वर्ज़न (version) >= '%s' सुझावित है) उपलब्ध नहीं है

source: package '%s' (version >= '%s' is suggested) is available but version '%s' is currently installed
hi_in: पैकेज (package) '%s' (वर्ज़न (version) >= '%s' सुझावित है) उपलब्ध है लेकिन वर्तमान में वर्ज़न (version) '%s' इंस्टॉल (installed) किया गया है

source: package '%s' (version >= '%s' is suggested) is already loaded, but version '%s' is currently installed
hi_in: पैकेज (package) '%s' (वर्ज़न (version) >= '%s' सुझावित है) पहले से लोड किया हुआ है, लेकिन वर्तमान में वर्ज़न (version) '%s' इंस्टॉल (installed) किया गया है

source: trying to load package '%s' (version >= '%s') ...
hi_in: पैकेज (package) '%s' (वर्ज़न (version) >= '%s') को लोड करने का प्रयास किया जा रहा है ...

source: trying to load package '%s' ...
hi_in: पैकेज (package) '%s' को लोड (load) करने का प्रयास किया जा रहा है ...

source: package '%s' (version >= '%s' is required) is already loaded, but version '%s' is currently installed. It's too late to use version >= '%s' now.
hi_in: पैकेज (package) '%s' (वर्ज़न (version) >= '%s' आवश्यक है) पहले से लोड किया हुआ है, लेकिन वर्तमान में वर्ज़न (version) '%s' इंस्टॉल (installed) किया गया है। अब वर्ज़न (version) >= '%s' का उपयोग करने में बहुत देर हो चुकी है।

source: package '%s' (version '%s' is required) is already loaded, but version '%s' is currently installed. It's too late to use version '%s' now.
hi_in: पैकेज (package) '%s' (वर्ज़न (version) '%s' आवश्यक है) पहले से लोड किया हुआ है, लेकिन वर्तमान में वर्ज़न (version) '%s' इंस्टॉल (installed) किया गया है। अब वर्ज़न (version) '%s' का उपयोग करने में बहुत देर हो चुकी है।
